[
{"title": ["Not Born of Woman: Gendered Robots"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/not-born-of-woman-gendered-robots", "abstract": ["This chapter posits that gender, while being messy and non-binary, is a salient consideration in the development of virtual and embodied robots to avoid replicating stereotypical representations of men and women's roles and occupations in our future artificial work colleagues, and companions. Some questions are posed for robot developers with early responses from researchers working in the field."], "Keywords": ["Robots"], "authors_name": ["Shah, H.", "Roberts, F.", "Springer Nature Switzerland AG"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/huma-shah"], "publication_date": ["26 Feb 2023"]},
{"title": ["Entropy‐based lamarckian quantum‐behaved particle swarm optimization for flexible ligand docking"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/entropybased-lamarckian-quantumbehaved-particle-swarm-optimizatio", "abstract": ["AutoDock is a widely used software for flexible ligand docking problems since it is open source and easy to be implemented. In this paper, a novel hybrid algorithm is proposed and applied in the docking environment of AutoDock version 4.2.6 in order to enhance the accuracy and the efficiency for dockings with flexible ligands. This search algorithm, called entropy-based Lamarckian quantum-behaved particle swarm optimization (ELQPSO), is a combination of the QPSO with an entropy-based update strategy and the Solis and Wet local search (SWLS) method. By using the PDBbind core set v.2016, the ELQPSO is compared with the Lamarckian genetic algorithm (LGA), Lamarckian particle swarm optimization (LPSO) and Lamarckian QPSO (LQPSO). The experimental results reveal that the corresponding docking program of ELQPSO, named as EQDOCK in this paper, has a competitive performance in dealing with the protein-ligand docking problems. Moreover, for the test cases with different number of torsions, the EQDOCK outperforms the other three docking programs in finding docking conformations with small root mean squared deviation (RMSD) values in most cases. In particular, it has an advantage of solving highly flexible ligand docking problems over the others."], "Keywords": ["Ligands", "Entropy", "Particle swarm optimization (PSO)", "Ligand", "Torsion", "Conformations", "Torsional stress", "Software"], "authors_name": ["You, Q.", "Li, C.", "Sun, J.", "Palade, V.", "Pan, F."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Mar 2023"]},
{"title": ["Diabetic Retinopathy Detection Using Transfer and Reinforcement Learning with Effective Image Preprocessing and Data Augmentation Techniques"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/diabetic-retinopathy-detection-using-transfer-and-reinforcement-l", "abstract": ["Diabetic retinopathy is the consequence of advanced stages of diabetes, which can ultimately lead to permanent blindness. An early detection of diabetic retinopathy is extremely important to avoid blindness and to recover from it as soon as possible. This chapter discusses the application of recent deep and transfer learning models for medical image analysis, with the focus on diabetic retinopathy detection. The chapter presents an extensive discussion on the publicly available datasets with diabetic retinopathy images, and the Kaggle dataset is used for training and testing of our proposed model. The main challenges to handle noisy and not large enough datasets are discussed in this chapter as well, where image preprocessing techniques and data augmentation play a significant role. An extensive overview of recent data augmentation techniques is also given to tackle the problem of imbalanced nature of diabetic retinopathy datasets. The proposed model integrates deep learning and reinforcement learning to perform detection and imbalanced classification on the Kaggle dataset."], "Keywords": ["Transfer learning", "Reinforcement learning", "Deep learning", "Medical problems", "Large dataset", "Image analysis", "Testing"], "authors_name": ["Tariq, M.", "Palade, V.", "Ma, Y.", "Altahhan, A.", "Springer "], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/maria-tariq", "https://pureportal.coventry.ac.uk/en/persons/yingliang-ma"], "publication_date": ["7 Feb 2023"]},
{"title": ["Kernel-based Nonlinear Manifold Learning for EEG Functional Connectivity Analysis with Application to Alzheimer's Disease"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/kernel-based-nonlinear-manifold-learning-for-eeg-functional-conne", "abstract": ["Dynamical, causal and cross-frequency coupling analysis using the EEG has received significant interest for the analysis and diagnosis of neurological disorders [1]–[3]. Due to the high computational requirements needed for some of these methods, EEG channel selection is crucial [4]. Functional connectivity (FC) between EEG channels is often used for channel selection and connectivity analysis [4, S, 6]. Ideally, in the case of selecting channels for dynamical and causal analysis, FC methods should be able to account for linear and nonlinear spatial and temporal interactions between EEG channels. In neuroscience, FC is quantified using different measures of (dis) similarity to assess the statistical dependence between two signals [5]. However, the interpretation of FC measures can differ significantly from one measure to another[5, 7]. In the early diagnosis of AD, [7] showed correlations among various (dis)similarity measures, and therefore these measures can be grouped. Thus, one from each is sufficient to extract information from the data [7]. Therefore, the development of a generic measure of (dis)similarity is important in FC analysis."], "Keywords": ["Functional analysis", "Electroencephalography"], "authors_name": ["Gunawardena, S. R. A. S.", "Sarrigiannis, P. G.", "Blackburn, D. J.", "He, F."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/shenal-rajintha-alexander-samarathunge-gunawardena", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["19 Jan 2023"]},
{"title": ["An Extended Plant Circadian Clock Model for Characterising Flowering Time under Different Light Quality Conditions"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-extended-plant-circadian-clock-model-for-characterising-flower", "abstract": [], "Keywords": ["Clocks", "Productivity", "Color", "Mathematical models", "Experiments"], "authors_name": ["Pay, M. L.", "Christensen, J.", "He, F.", "Roden, L.", "Ahmed, H.", "Foo, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/jesper-christensen", "https://pureportal.coventry.ac.uk/en/persons/miao-lin-pay", "https://pureportal.coventry.ac.uk/en/persons/laura-roden", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["9 Jan 2023"]},
{"title": ["Extracting the Evolutionary Backbone of Scientific Domains: The Semantic Main Path Network Approach Based on Citation Context Analysis"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/extracting-the-evolutionary-backbone-of-scientific-domains-the-se", "abstract": ["Main path analysis is a popular method for extracting the scientific backbone from the citation network of a research domain. Existing approaches ignored the semantic relationships between the citing and cited publications, resulting in several adverse issues, in terms of coherence of main paths and coverage of significant studies. This paper advocated the semantic main path analysis approach to alleviate these issues based on citation function analysis. A wide variety of SciBERT-based deep learning models were designed for identifying citation functions. Semantic citation networks were built by either including important citations, e.g., extension, motivation, usage and similarity, or excluding incidental citations like background and future work. Semantic main path network was built by merging the top-K main paths extracted from various time slices of semantic citation network. In addition, this study proposed a three-way framework for quantitative evaluation of main path analysis results. Both qualitative and quantitative analysis on three research areas of computational linguistics demonstrated that, compared to semantics-agnostic counterparts, different types of semantic main path networks provide complementary views scientific knowledge flows. Combining them together, we can obtain a more precise and comprehensive picture of domain evolution and uncover more coherent development pathways between scientific ideas. "], "Keywords": ["context analysis", "Citations", "semantics", "Evolutionary", "Semantics", "path analysis", "Path Analysis", "Top-k"], "authors_name": ["Jiang, X.", "Liu, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["15 Feb 2023"]},
{"title": ["Gene Regulatory Network Inference through Link Prediction using Graph Neural Network"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/gene-regulatory-network-inference-through-link-prediction-using-g", "abstract": ["Gene Regulatory Networks (GRNs) depict the causal regulatory interactions between transcription factors (TFs) and their target genes [2], where TFs are proteins that regulate gene transcription. GRN plays a vital role in explaining gene function, which helps to identify and prioritize the candidate genes for functional analysis [3]. Currently, high-dimensional transcriptome datasets are produced from high-throughput sequencing techniques, such as microarray and RNA-Seq. These techniques can capture the differences in the expression of thousands of genes at once. Through these wet-lab experiments, studying the interconnections among a large number of genes or TFs at a network level is challenging [4]. Therefore, one of the important topics in computational biology is the inference of GRNs from high-dimensional gene expression data through statistical and machine learning approaches [2]."], "Keywords": ["Genes", "Neural networks", "Transcription factors", "Functional analysis", "RNA", "Transcription", "Microarrays", "Gene expression"], "authors_name": ["Ganeshamoorthy, S.", "Roden, L.", "Klepl, D.", "He, F."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/laura-roden", "https://pureportal.coventry.ac.uk/en/persons/dominik-klepl", "https://pureportal.coventry.ac.uk/en/persons/sivasharmini-ganeshamoorthy", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["19 Jan 2023"]},
{"title": ["Challenges and prospects of climate change impact assessment on mangrove environments through mathematical models"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/challenges-and-prospects-of-climate-change-impact-assessment-on-m", "abstract": ["The impacts of climate change, especially sea-level rise, are an increasing threat to the world’s coastal regions. Following recommendations made by the United Nations about the preservation of mangrove environments, particularly given their potential for effective natural defence against wave-driven hazards, a series of experiments have been conducted to quantify the ability of mangroves to counter climate change impacts. To date, these experiments have been limited by computational cost and inability to model multiple scenarios. With improved data quality and availability, machine learning has enormous potential to supplement, or even replace, existing numerical methods. This article presents both an outline of the importance of protecting mangrove environments and a review of methods currently used to quantify the capacity of mangroves to adapt to climate change impacts. In view of the limitations of existing numerical methods, the article also discusses the potential of machine learning as an efficient and effective alternative."], "Keywords": ["Climate change", "climate change impact", "impact assessment", "mangrove", "Mathematical models", "Numerical methods", "Environment", "machine learning"], "authors_name": ["Fanous, M.", "Eden, J.", "Remesan, R.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/majdi-fanous", "https://pureportal.coventry.ac.uk/en/persons/alireza-daneshkhah", "https://pureportal.coventry.ac.uk/en/persons/jonathan-eden"], "publication_date": ["25 Feb 2023"]},
{"title": ["A Hybrid Linear Iterative Clustering and Bayes Classification-Based GrabCut Segmentation Scheme for Dynamic Detection of Cervical Cancer"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-hybrid-linear-iterative-clustering-and-bayes-classification-bas", "abstract": [], "Keywords": ["cancer", "Superpixels", "Energy", "Mixture", "Molecular Cluster", "smear", "cytoplasm", "cells"], "authors_name": ["Magaraja, A. D.", "Rajapackiyam, E.", "Kanagaraj, V.", "Kanagaraj, S. J.", "Kotecha, K.", "Vairavasundaram, S.", "Mehta, M.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["18 Oct 2022"]},
{"title": ["XDLL: Explained Deep Learning LiDAR-Based Localization and Mapping Method for Self-Driving Vehicles"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/xdll-explained-deep-learning-lidar-based-localization-and-mapping", "abstract": ["Self-driving vehicles need a robust positioning system to continue the revolution in intelligent transportation. Global navigation satellite systems (GNSS) are most commonly used to accomplish this task because of their ability to accurately locate the vehicle in the environment. However, recent publications have revealed serious cases where GNSS fails miserably to determine the position of the vehicle, for example, under a bridge, in a tunnel, or in dense forests. In this work, we propose a framework architecture of explaining deep learning LiDAR-based (XDLL) models that predicts the position of the vehicles by using only a few LiDAR points in the environment, which ensures the required fastness and accuracy of interactions between vehicle components. The proposed framework extracts non-semantic features from LiDAR scans using a clustering algorithm. The identified clusters serve as input to our deep learning model, which relies on LSTM and GRU layers to store the trajectory points and convolutional layers to smooth the data. The model has been extensively tested with short- and long-term trajectories from two benchmark datasets, Kitti and NCLT, containing different environmental scenarios. Moreover, we investigated the obtained results by explaining the contribution of each cluster feature by using several explainable methods, including Saliency, SmoothGrad, and VarGrad. The analysis showed that taking the mean of all the clusters as an input for the model is enough to obtain better accuracy compared to the first model, and it reduces the time consumption as well. The improved model is able to obtain a mean absolute positioning error of below one meter for all sequences in the short- and long-term trajectories."], "Keywords": ["Deep learning", "Trajectories", "Satellites", "Navigation", "Clustering algorithms", "Tunnels"], "authors_name": ["Charroud, A.", "El Moutaouakil, K. E.", "Palade, V.", "Yahyaouy, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["22 Jan 2023"]},
{"title": ["PoseNormNet: Identity-preserved Posture Normalization of 3D Body Scans in Arbitrary Postures"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/posenormnet-identity-preserved-posture-normalization-of-3d-body-s", "abstract": ["3D human models accurately represent the shape of the subjects, which is key to many human-centric industrial applications, including fashion design, body biometrics extraction, and computer animation. These tasks usually require a high-fidelity human body mesh in a canonical posture (e.g., ‘A’ pose or ‘T’ pose). Although 3D scanning technology is fast and popular for acquiring the subject's body shape, automatically normalizing the posture of scanned bodies is still under-researched. Existing methods highly rely on skeleton-driven animation technologies. However, these methods require carefully-designed skeleton and skin weights, which is time-consuming and fails when the initial posture is complicated. In this work, a novel deep learning-based approach, dubbed PoseNormNet, is proposed to automatically normalize the postures of scanned bodies. The proposed algorithm provides strong operability since it does not require any rigging priors and works well for subjects in arbitrary postures. Extensive experimental results on both synthetic and real-world datasets demonstrate that the proposed method achieves state-of-the-art performance in both objective and subjective terms."], "Keywords": ["Animation", "Biometrics", "Industrial applications", "Deep learning", "Skin", "Scanning"], "authors_name": ["Zhao, R.", "Dai, X.", "Hu, P.", "Munteanu, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/pengpeng-hu"], "publication_date": ["16 Feb 2023"]},
{"title": ["Unidirectional Migration of Populations with Allee Effect"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/unidirectional-migration-of-populations-with-allee-effect", "abstract": ["In this note we consider two populations living on identical patches, connected by unidirectional migration, and subject to strong Allee effect. We show that by increasing the migration rate, there are more bifurcation sequences than previous works showed. In particular, the number of steady states can change from 9 (small migration) to 3 (large migration) at a single bifurcation point, or via a sequence of bifurcations with the system having 9, 7, 5, 3 steady states or 9, 7, 9, 3 steady states, depending on the Allee threshold. This is in contrast with the case of bidirectional migration, where the number of steady states always goes through the same bifurcation sequence of 9, 5, 3 steady states as we increase the migration rate, regardless of the value of the Allee threshold. These results have practical implications as well in spatial ecology."], "Keywords": ["Ecology", "Allee Effect", "Migration", "Population", "Bifurcation", "Bifurcation Point", "Patch"], "authors_name": ["Röst, G.", "Sadeghimanesh, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["10 Jan 2023"]},
{"title": ["An Effective Swarm Intelligence Optimization Algorithm for Flexible Ligand Docking"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-effective-swarm-intelligence-optimization-algorithm-for-flexib", "abstract": ["In general, flexible ligand docking is used for docking simulations under the premise that the position of the binding site is already known, and meanwhile, it can also be used without prior knowledge of the binding site. However, most of the optimization search algorithms used in popular docking software are far from being ideal in the first case, and they can hardly be directly utilized for the latter case due to the relatively large search area. In order to design an algorithm that can flexibly adapt to different sizes of the search area, we propose an effective swarm intelligence optimization algorithm in this paper, called diversity-controlled Lamarckian quantum particle swarm optimization (DCL-QPSO). The highlights of the algorithm are a diversity-controlled strategy and a modified local search method. Integrated with the docking environment of Autodock, the DCL-QPSO is compared with Autodock Vina, Glide and other two Autodock-based search algorithms for flexible ligand docking. Experimental results revealed that the proposed algorithm has a performance comparable to those of Autodock Vina and Glide for dockings within a certain area around the binding sites, and is a more effective solver than all the compared methods for dockings without prior knowledge of the binding sites."], "Keywords": ["Swarm Intelligence", "Docking", "Ligands", "Swarm intelligence", "Optimization Algorithm", "Intelligence", "Binding sites", "Binding Sites"], "authors_name": ["Li, C.", "Sun, J.", "Li, L-W.", "Wu, X.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["1 Sep 2022"]},
{"title": ["An Agent-Based Optimisation Approach for Vehicle Routing Problem with Unique Vehicle Location and Depot"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-agent-based-optimisation-approach-for-vehicle-routing-problem-", "abstract": ["The Vehicle Routing Problem (VRP) is a well studied logistical problem along with its various variants such as VRP with customer Time-Window (VRPTW). However, all the previously studied variants assume that vehicles are mostly the same in terms of their capacity, location and home location (depot). This study uses the agent-based approach for solving VRPTW with vehicle's unique location and depot. This is to minimise the number of used vehicles as the main target. Other targets including total distance travelled, waiting time and time are also considered as criteria to evaluate the quality of the generated vehicle routes. This is achieved by proposing a Messaging Protocol-based Heuristics Optimisation (MPHO) model that balances between centrally-distributed agents' interactions and accommodates certain priority rules specifically developed for the problem. Furthermore, modifications to certain constraints checking techniques are introduced by implementing time Push Forward (PF) checking recursively tailored to the route's unique start/ending locations as well as calculating the reduced waiting time to find and check the limit of the total route duration. In order to justify the superiority of the proposed MPHO model, numerical tests have been conducted on benchmark problems including single and multiple depot instances as well as modified instances tailored to the problem. This is made possible by randomising vehicles' capacities and their unique locations and depots. Key results reveal that, in multiple depot instances, higher quality solutions compared with previous benchmark outcomes are obtained in terms of minimising the total number of vehicles along with fastest solution time (CPU) at the expense of total time and distance travelled."], "Keywords": ["Vehicle routing", "Network protocols", "Program processors"], "authors_name": ["Abu-Monshar, A.", "Al Bazi, A.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/ammar-al-bazi"], "publication_date": ["15 Apr 2022"]},
{"title": ["A community energy management system for smart microgrids"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-community-energy-management-system-for-smart-microgrids", "abstract": ["Community micro-grid energy projects are needed to drive de-carbonisation and increase equity of energy systems among displaced communities. However, micro-grid solutions are often inflexible and lack functionality to respond to displaced community energy needs and ensure the long-term sustainability of interventions. This paper explores the use of fog-computing retrofit architectures deployed on community micro-grid infrastructures to enable flexible demand management to improve service delivery and longevity. A micro-services solution is proposed that decouples components increasing resilience and testability while allowing hybrid edge-cloud deployments. The architecture is outlined and demonstrated for a micro-grid providing energy to two nurseries and a playground in Kigeme refugee camp, Rwanda. To enact the community priorities within the demand management system, modified Genetic Algorithm (GA) methods are outlined and tested for different use-case scenarios. The performance of the modified GA methods are then compared with a pre-existing battery protect controller and an alternative deterministic (space-shared) energy manager model. A modified search space GA method was required for GA to outperform both the existing battery controller and proposed deterministic method in terms of achieving the highest utility function in almost every use-case. The results further showed how simple community priorities can be set and used to enact control on the system in 24h timeframes that are in line with the local decision-making context."], "Keywords": ["Energy management systems", "Microgrids", "Genetic algorithms", "Fog computing", "Carbonization", "Controllers", "Sustainable development", "Managers"], "authors_name": ["Verba, N.", "Nixon, J. D.", "Gaura, E.", "Dias, L. A.", "Halford, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/jonathan-nixon", "https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/elena-gaura"], "publication_date": ["Aug 2022"]},
{"title": ["Allocating Medical Resources (vaccine) to Control a Pandemic"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/allocating-medical-resources-vaccine-to-control-a-pandemic", "abstract": ["In the aftermath of the COVID-19 pandemic, we need to better understand how to prepare for other pandemics in the future. This research uses computational techniques to better understand how medical resources can be allocated to controlling pandemics. Mathematical modelling techniques are used to study the transmission dynamics of infectious diseases, and to estimate the cost of implementing control measures. A mathematical model is used to solve problem statements drawn from assumptions. Optimizing the allocation of resources can be achieved by using algorithms to optimise the cost of distributing resources in order to control a pandemic. The goal of this research would be to find the most cost-effective algorithm, utilizing all operational research methodologies. In general, the product is software that implements the best algorithm designed to deal with the problem of resource allocation for pandemics."], "Keywords": ["Vaccines", "Costs", "Resource allocation", "Mathematical models"], "authors_name": ["Ajao-Olarinoye, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/michael-ajao-olarinoye"], "publication_date": ["26 Apr 2022"]},
{"title": ["An integrated framework for diagnosing process faults with incomplete features"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-integrated-framework-for-diagnosing-process-faults-with-incomp", "abstract": ["Handling missing values and large-dimensional features are crucial requirements for data-driven fault diagnosis systems. However, most intelligent data-driven diagnostic systems are not able to handle missing data. The presence of high-dimensional feature sets can also further complicate the process of fault diagnosis. This paper aims to devise a missing data imputation unit along with a dimensionality reduction unit in the pre-processing module of the diagnostic system. This paper proposes a novel pooling strategy for missing data imputation (PSMI). This strategy can simplify complex patterns of missingness and incrementally update the pool. The pre-processing module receives incomplete observations, PSMI estimates missing values, and, then, the dimensionality reduction unit transforms completed observations onto a lower-dimensional feature space. These transformed observations are then fed as inputs to the fault classification module for decision making and diagnosis. This diagnostic scheme makes use of various state-of-the-art missing data imputation, dimensionality reduction and classification algorithms. This enables a comprehensive comparison and allows to find the best techniques for the sake of diagnosing faults in the Tennessee Eastman process. The obtained results show the effectiveness of the proposed pooling strategy and indicate that principal component analysis imputation and heteroscedastic discriminant analysis approaches outperform other imputation and dimensionality reduction techniques in this diagnostic application."], "Keywords": ["Dimensionality reduction", "Failure analysis", "Discriminant analysis", "Principal component analysis", "Decision making"], "authors_name": ["Razavi-Far, R.", "Saif, M.", "Palade, V.", "Chakrabarti, S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Jan 2022"]},
{"title": ["An improved Gaussian distribution based quantum-behaved particle swarm optimization algorithm for engineering shape design problems"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-improved-gaussian-distribution-based-quantum-behaved-particle-", "abstract": ["In this article, an improved Gaussian distribution based quantum-behaved particle swarm optimization (IG-QPSO) algorithm is proposed to solve engineering shape design problems with multiple constraints. In this algorithm, the Gaussian distribution is employed to generate the sequence of random numbers in the QPSO algorithm. By decreasing the variance of the Gaussian distribution linearly, the algorithm is able not only to maintain its global search ability during the early search stages, but can also obtain gradually enhanced local search ability in the later search stages. Additionally, a weighted mean best position in the IG-QPSO is employed to achieve a good balance between local search and global search. The proposed algorithm and some other well-known PSO variants are tested on ten standard benchmark functions and six well-studied engineering shape design problems. Experimental results show that the IG-QPSO algorithm can optimize these problems effectively in terms of precision and robustness compared to its competitors."], "Keywords": ["Particle Swarm Optimization Algorithm", "Shape Design", "Engineering Design", "Particle Swarm Optimization", "Gaussian distribution", "Particle swarm optimization (PSO)", "Global Search", "Local Search"], "authors_name": ["Chen, Q.", "Sun, J.", "Palade, V.", "Wu, X.", "Shi, X."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["4 May 2022"]},
{"title": ["Cell site analysis; Changes to networks with time"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/cell-site-analysis-changes-to-networks-with-time", "abstract": ["Cell service areas may change over time as sites or cells are adjusted, decommissioned or introduced, and there may have been changes between the time of calls and the analysis undertaken. The manner in which survey data is used as part of an analysis is of particular relevance as the data gathered may not reflect the state of the network at the time of calls and thus potentially mislead. Overlaying “historic” data (potentially generated before the calls) with “targeted” surveys (usually generated after the calls) may enable an assessment of possible network changes, or whether additional cells may also have served at a given location at a previous time. This paper outlines a case in which there was a significant time gap between the analysis of call data records and the date on which they were generated."], "Keywords": ["Data Analysis"], "authors_name": ["Tart, M. S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-stephen-tart"], "publication_date": ["May 2022"]},
{"title": ["An SMT solver for non-linear real arithmetic inside Maple"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-smt-solver-for-non-linear-real-arithmetic-inside-maple", "abstract": [], "Keywords": [], "authors_name": ["Sadeghimanesh, A.", "England, M.", "Application of Amazon Web Services within teaching & learning at Coventry University Group", "Flood, D.", "Hall, A.", " Association for Computing Machinery"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["6 Jul 2022"]},
{"title": ["Bispectrum-based Cross-frequency Functional Connectivity: Classification of Alzheimer's disease"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/bispectrum-based-cross-frequency-functional-connectivity-classifi", "abstract": ["Alzheimer’s disease (AD) is a neurodegenerative disease known to affect brain functional connectivity (FC). Linear FC measures have been applied to study the differences in AD by splitting neurophysiological signals such as electroencephalography (EEG) recordings into discrete frequency", "bands and analysing them in isolation. We address this limitation by quantifying cross-frequency FC in addition to the traditional within-band approach. Cross-bispectrum, a higher-order spectral analysis, is used to measure the nonlinear FC and is compared with the cross-spectrum, which only measures the linear FC within bands. Each frequency coupling is then used to construct an FC network, which is in turn vectorised and used to train a classifier. We show that fusing features from networks improves classification accuracy. Although both within-frequency and cross-frequency networks can be used to predict AD with high accuracy, our results show that bispectrum-based FC outperforms cross-spectrum suggesting an important role of cross-frequency FC."], "Keywords": ["Neurodegenerative diseases", "Spectrum analysis", "Electroencephalography", "Brain", "Classifiers"], "authors_name": ["Klepl, D.", "He, F.", "Wu, M.", "Blackburn, D. J.", "Sarrigiannis, P. G."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/dominik-klepl", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["8 Sep 2022"]},
{"title": ["Artificial Intelligence in Cars: How Close Yet Far Are We from Fully Autonomous Vehicles?"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/artificial-intelligence-in-cars-how-close-yet-far-are-we-from-ful", "abstract": ["In the last several years, strides in Artificial Intelligence (AI) have allowed for substantial developments in autonomous driving. As a result, moving to Level-4 and Level-5 autonomy in the near future is starting to look like a certain possibility. Use of AI in vehicles and, in particular, cutting-edge computer vision, signal processing and control techniques have contributed significantly to the high-tech nature of state-of-the-art Advanced Driver Assistance Systems (ADAS) available in cars today. In modern automobiles, AI not only contributes substantially to systems such as ADAS, but also in the areas of vehicles’ connectivity, automotive cybersecurity, and smart road infrastructure development. The next generation driverless vehicles will be completely reliant on these technologies to transport passengers and goods from one place to other, whilst eliminating human intervention entirely. However, despite the many advancements in AI for connected and autonomous vehicles done so far, there are several issues that are responsible of holding back the wide-scale deployment of AI based autonomous vehicles on roads, which are discussed in this editorial paper. Until and unless these critical issues are addressed, it would be difficult to indicate an accurate future moment in time when autonomous vehicles will become a reality globally."], "Keywords": ["Autonomous vehicles", "Artificial intelligence", "Advanced driver assistance systems", "Security of data", "Automobiles", "Computer vision", "Signal processing"], "authors_name": ["Palade, V.", "Deo, A.", "Assessing Risks in Dairy Supply Chain Systems: A System Dynamics Approach", "Azizsafaei, M.", "Hosseinian-Far, A.", "Khandan, R.", "Sarwar, D.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/ankur-deo"], "publication_date": ["3 May 2022"]},
{"title": ["An SMT solver for non-linear real arithmetic inside maple"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-smt-solver-for-non-linear-real-arithmetic-inside-maple-2", "abstract": ["We report on work-in-progress to create an SMT-solver inside Maple for non-linear real arithmetic (NRA). We give background information on the algorithm being implemented: cylindrical algebraic coverings as a theory solver in the lazy SMT paradigm. We then present some new work on the identification of minimal conflicting cores from the coverings."], "Keywords": ["Maple", "Covering", "Paradigm", "Background"], "authors_name": ["Sadeghimanesh, A.", "England, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["23 Nov 2022"]},
{"title": ["Brain Tumor Classification Using a Combination of Variational Autoencoders and Generative Adversarial Networks"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/brain-tumor-classification-using-a-combination-of-variational-aut", "abstract": [], "Keywords": ["Classifier", "Brain Neoplasms", "Deep Learning", "Positron", "Magnetic Resonance", "Noise", "Datasets", "Magnetic Resonance Imaging"], "authors_name": ["Ahmad, B.", "Sun, J.", "You, Q.", "Palade, V.", "Mao, Z."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["21 Jan 2022"]},
{"title": ["Characterising Alzheimers Disease with EEG-based Energy Landscape Analysis"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/characterising-alzheimers-disease-with-eeg-based-energy-landscape-2", "abstract": [], "Keywords": ["Electroencephalography", "Alzheimer Disease", "Alzheimer Disease 10", "Brain", "Neurodegenerative diseases", "Neurodegenerative Diseases", "Chemical activation", "Datasets"], "authors_name": ["Klepl, D.", "He, F.", "Wu, M.", "De Marco, M.", "Blackburn, D.", "Sarrigiannis, P. G."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/dominik-klepl", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["1 Mar 2022"]},
{"title": ["Comparative Graph-based Summarization of Scientific Papers Guided by Comparative Citations"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/comparative-graph-based-summarization-of-scientific-papers-guided", "abstract": ["With the rapid growth of scientific papers, understanding the changes and trends in a research area is rather time-consuming. The first challenge is to find related and comparable articles", "for the research. Comparative citations compare co-cited papers in a citation sentence and can serve as good guidance for researchers to track a research area. We thus go through", "comparative citations to find comparable objects and build a comparative scientific summarization corpus (CSSC). And then, we propose the comparative graph-based summarization", "(CGSUM) method to create comparative summaries using citations as guidance. The comparative graph is constructed using sentences as nodes and three different relationships of sentences", "as edges. The relationship that sentences occur in the same paper is used to calculate the salience of sentences, the relationship that sentences occur in two different papers is used to calculate the difference between sentences, and the relationship that sentences are related to citations is used to calculate the commonality of", "sentences. Experiments show that CGSUM outperforms", "comparative baselines on CSSC and performs well on DUC2006 and DUC2007."], "Keywords": ["Experiments"], "authors_name": ["Chen, J.", "Cai, C.", "Jiang, X.", "Chen, K.", "ACL (Association for Computational Linguistics)", "Comparing the Behaviour of Two Topic-Modelling Algorithms in COVID-19 Vaccination Tweets", "Bignell, J. T.", "Chantziplakis, G.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["Oct 2022"]},
{"title": ["Differential radial basis function network for sequence modelling"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/differential-radial-basis-function-network-for-sequence-modelling", "abstract": ["We propose a differential radial basis function (RBF) network termed RBF-DiffNet—whose hidden layer blocks are partial differential equations (PDEs) linear in terms of the RBF—to make the baseline RBF network robust to noise in sequential data. Assuming that the sequential data derives from the discretisation of the solution to an underlying PDE, the differential RBF network learns constant linear coefficients of the PDE, consequently regularising the RBF network by following modified backward-Euler updates. We experimentally validate the differential RBF network on the logistic map chaotic timeseries as well as on 30 real-world timeseries provided by Walmart in the M5 forecasting competition. The proposed model is compared with the normalised and unnormalised RBF networks, ARIMA, and ensembles of multilayer perceptrons (MLPs) and recurrent networks with long short-term memory (LSTM) blocks. From the experimental results, RBF-DiffNet consistently shows a marked reduction in the prediction error over the baseline RBF network (e.g., 41% reduction in the root mean squared scaled error on the M5 dataset, and 53% reduction in the mean absolute error on the logistic map); RBF-DiffNet also shows a comparable performance to the LSTM ensemble but requires 99% less computational time. Our proposed network consequently enables more accurate predictions—in the presence of observational noise—in sequence modelling tasks such as timeseries forecasting that leverage the model interpretability, fast training, and function approximation properties of the RBF network."], "Keywords": ["Radial basis function networks", "Partial differential equations", "Long short-term memory", "Logistics", "Multilayer neural networks"], "authors_name": ["Gyamfi, K. S.", "Brusey, J.", "Gaura, E.", "Edge-Enhancement DenseNet for X-ray Fluoroscopy Image Denoising in Cardiac Electrophysiology Procedures", "Luo, Y.", "Ma, Y.", "Brien, H. O.", "Jiang, K.", "Rhode, K."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/elena-gaura"], "publication_date": ["1 Mar 2022"]},
{"title": ["Clogs and Shawls: Mormons, Moorlands, and the Search for Zion"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/clogs-and-shawls-mormons-moorlands-and-the-search-for-zion", "abstract": [], "Keywords": [], "authors_name": ["Halford, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["31 Jan 2022"]},
{"title": ["Contextualised Segment-Wise Citation Function Classification"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/contextualised-segment-wise-citation-function-classification", "abstract": ["Much effort has been made in the past decades to citation function classification. Noteworthy issues exist. Annotation difficulty made existing datasets quite limited in size, especially for minority classes, and quite limited in the representativeness of a scientific domain. Different annotation schemes made existing studies not easily mappable and comparable. Concerning algorithmic classification, state-of-the-art deep learning-based methods are flawed by generating a feature vector for the whole citation context (or sentence) and failing to exploit the full realm of citation modelling options. Responding to these issues, this paper studied contextualised citation function classification. Specifically, a large new citation context dataset was created by merging and re-annotating six datasets about computational linguistics. A variety of strong SciBERT-based citation function classification models were proposed. In addition to achieving the new state of the art of citation function classification, this study focused on deeper performance analysis of to answer several research questions about the effective ways of performing citation function classification, more specifically, the necessity of modelling in-text citations in context and doing citation function classification at citation (segment) level. A particular emphasis was placed on in-depth per-class performance analysis for the purpose of understanding whether citation function classification is robust enough for scientometric applications, what implications can be derived for the applicability of citation function classification to different scientometric analysis tasks, and what further efforts are required to meet such analytic needs. "], "Keywords": ["computational linguistics", "Computational linguistics", "Merging", "performance", "Deep learning", "minority", "learning"], "authors_name": ["Jiang, X.", "Chen, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["2022"]},
{"title": ["Exploiting Domain Structures in Heuristic Algorithms for the Set Covering Problem: A Literature Review"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/exploiting-domain-structures-in-heuristic-algorithms-for-the-set-", "abstract": ["This review aims at understanding the set covering problem (SCP) as an NP-hard problem, the variants of SCP, the methods that have been proposed to solve the problem, and gaps in the existing solutions that have been provided which need further research. A polynomial time algorithm to give an optimal solution to the Set Covering Problem is only possible if P=NP and so we do not expect to find such an algorithm. Instead, various heuristic algorithms have been used in an attempt to find an optimal solution for the problem. Exploring these types of algorithms provides solutions that are usable, or near optimal, but not exact which reduces the computational cost for the set covering problem. A comparison of metaheuristic algorithms and optimization of these algorithms is explored in this review"], "Keywords": ["Heuristic algorithms", "Set theory", "NP-hard", "Polynomials", "Costs"], "authors_name": ["Babatunde, A.", "Exploring dynamical properties of a Type 1 diabetes model using sensitivity approaches", "Al Ali, H.", "Daneshkhah, A.", "Boutayeb, A.", "Malunguza, N. J.", "Mukandavire, Z."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/abiola-babatunde"], "publication_date": ["1 Apr 2022"]},
{"title": ["Data-driven dynamical modelling of a pathogen-infected plant gene regulatory network: A comparative analysis"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/data-driven-dynamical-modelling-of-a-pathogen-infected-plant-gene", "abstract": ["Recent advances in synthetic biology have enabled the design of genetic feedback control circuits that could be implemented to build resilient plants against pathogen attacks. To facilitate the proper design of these genetic feedback control circuits, an accurate model that is able to capture the vital dynamical behaviour of the pathogen-infected plant is required. In this study, using a data-driven modelling approach, we develop and compare four dynamical models (i.e. linear, Michaelis-Menten with Hill coefficient (Hill Function), standard S-System and extended S-System) of a pathogen-infected plant gene regulatory network (GRN). These models are then assessed across several criteria, i.e. ease of identifying the type of gene regulation, the predictive capability, Akaike Information Criterion (AIC) and the robustness to parameter uncertainty to determine its viability of balancing between biological complexity and accuracy when modelling the pathogen-infected plant GRN. Using our defined ranking score, we obtain the following insights to the modelling of GRN. Our analyses show that despite commonly used and provide biological relevance, the Hill Function model ranks the lowest while the extended S-System model ranks highest in the overall comparison. Interestingly, the performance of the linear model is more consistent throughout the comparison, making it the preferred model for this pathogen-infected plant GRN when considering data-driven modelling approach."], "Keywords": ["Plant Genes", "Gene Regulatory Network", "Pathogens", "Comparative Analysis", "Data-driven", "Gene Regulatory Networks", "Genes", "S-system"], "authors_name": ["Foo, M.", "Dony, L.", "He, F.", "Detection of sleep apnea using Machine learning algorithms based on ECG Signals: A comprehensive systematic review", "Salari, N.", "Hosseinian-Far, A.", "Mohammadi, M.", "Ghasemi, H.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["Sep 2022"]},
{"title": ["Convolution neural networks for pothole detection of critical road infrastructure"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/convolution-neural-networks-for-pothole-detection-of-critical-roa", "abstract": [], "Keywords": ["Convolution", "Neural networks", "Accelerometers", "Smartphones", "Convolutional neural networks", "Repair", "Computational complexity", "Inspection"], "authors_name": ["Pandey, A. K.", "Palade, V.", "Iqbal, R.", "Maniak, T.", "Karyotis, C.", "Akuma, S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/anup-pandey-2"], "publication_date": ["Apr 2022"]},
{"title": ["Fast, detailed, accurate simulation of a thermal car-cabin using machine-learning"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/fast-detailed-accurate-simulation-of-a-thermal-car-cabin-using-ma", "abstract": ["Car-cabin thermal systems, including heated seats, air-conditioning, and radiant panels, use a large proportion of the energy budget of electric vehicles and thus reduce their effective range. Optimising these systems and their controllers might be possible with computationally efficient simulation. Unfortunately, state-of-the-art simulators are either too slow or provide little resolution of the cabin's thermal environment. In this work, we propose a novel approach to developing a fast simulation by machine learning (ML) from measurements within the car cabin over a number of trials within a climatic wind tunnel. A range of ML approaches are tried and compared. The best-performing ML approach is compared to more traditional 1D simulation in terms of accuracy and speed. The resulting simulation, based on Multivariate Linear Regression, is fast (5 microseconds per simulation second), and yields good accuracy (NRMSE 1.8%), which exceeds the performance of the traditional 1D simulator. Furthermore, the simulation is able to differentially simulate the thermal environment of the footwell versus the head and the driver position versus the front passenger seat, but unlike a traditional 1D model cannot support changes to the physical structure.", "This fast method for obtaining computationally efficient simulators of car cabins will accelerate adoption of techniques such as Deep Reinforcement Learning for climate control."], "Keywords": ["Machine learning", "Simulators", "Seats", "Climate control", "Hot Temperature", "Linear regression", "Reinforcement learning", "Air conditioning"], "authors_name": ["Jess, B. J.", "Brusey, J.", "Rostagno, M. M.", "Merlo, A. M.", "Gaura, E.", "Gyamfi, K. S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/brandi-jo-jess", "https://pureportal.coventry.ac.uk/en/persons/elena-gaura"], "publication_date": ["10 Mar 2022"]},
{"title": ["EEG-based Graph Neural Network Classification of Alzheimer's Disease: An Empirical Evaluation of Functional Connectivity Methods"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/eeg-based-graph-neural-network-classification-of-alzheimers-disea", "abstract": [], "Keywords": ["Electroencephalography", "Alzheimer Disease", "Brain", "Neural networks", "Computer Neural Networks", "Area Under Curve", "Physical Functional Performance", "Biomarkers"], "authors_name": ["Klepl, D.", "He, F.", "Wu, M.", "Blackburn, D. J.", "Sarrigiannis, P.", "Efficacy of COVID-19 vaccines by race and ethnicity", "Salari, N.", "Vepa, A.", "Daneshkhah, A.", "Darvishi, N.", "Ghasemi, H.", "Khunti, K.", "Mohammadi, M.", "Examining Type 1 Diabetes Mathematical Models Using Experimental Data", "Al Ali, H.", "Daneshkhah, A.", "Boutayeb, A.", "Mukandavire, Z."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/dominik-klepl", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["6 Sep 2022"]},
{"title": ["Feedback and Engagement on an Introductory Programming Module"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/feedback-and-engagement-on-an-introductory-programming-module", "abstract": ["We ran a study on engagement and achievement for a first year undergraduate programming module which  used an online learning environment containing tasks which generate automated feedback.  Students could also access human feedback from traditional labs. We gathered quantitative data on engagement and achievement which allowed us to split the cohort into 6 groups.  We then ran interviews with students after the end of the module to produce qualitative data on perceptions of what feedback is, how useful it is, the uses made of it, and how it bears on engagement. A general finding was that human and automated feedback are different but complementary. However there are different feedback needs by group. Our findings imply: (1) that a blended human-automated feedback approach improves engagement; and (2) that this approach needs to be differentiated according to type of student. We give implications for the design of feedback for programming modules. "], "Keywords": ["programming", "student", "learning environment", "Group", "interview"], "authors_name": ["Grawemeyer, B.", "Halloran, J.", "England, M.", "Croft, D.", "ACM"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/beate-grawemeyer", "https://pureportal.coventry.ac.uk/en/persons/john-halloran"], "publication_date": ["6 Jan 2022"]},
{"title": ["Leveraging Arabic sentiment classification using an enhanced CNN-LSTM approach and effective Arabic text preparation"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/leveraging-arabic-sentiment-classification-using-an-enhanced-cnn-", "abstract": [], "Keywords": ["Long short-term memory", "Convolutional neural networks", "Deep learning", "Semantics"], "authors_name": ["Alayba, A. M.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Nov 2022"]},
{"title": ["Framework for Generating Integrable Expressions"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/framework-for-generating-integrable-expressions", "abstract": ["Applications of machine learning are becoming more prominent in the field of computer algebra. Examples of such applications include selecting S-pairs in Buchberger’s algorithm or solving integrals and differential equations directly. With many of these applications, data must be generated to train a model. Methods such as generating binary trees representing mathematical expressions or created randomly in a recursive manner from a set of available function symbols, variables and constants have been discussed. However, these generated expressions do not represent a realistic dataset that draws from the typical Maple user’s experience.", "I propose a framework for generating valid mathematical expressions. More precisely, the focus will be on integrable expressions. The difference from other methods lies in the fact that the data generation method will be based on a test suite of data generated from Maple users. Thus, the new synthetic data will have properties similar to integrable expressions that Maple users would typically try. This data generation method will be used to train machine learning models that make efficient choices algorithm selection problems."], "Keywords": ["Machine learning", "Binary trees", "Integral equations", "Algebra", "User experience", "Differential equations", "Set theory"], "authors_name": ["Barket, R."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/rashid-barket"], "publication_date": ["2 Nov 2022"]},
{"title": ["Kac-Rice formulas and the number of solutions of parametrized systems of polynomial equations"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/kac-rice-formulas-and-the-number-of-solutions-of-parametrized-sys", "abstract": [" Kac-Rice formulas express the expected number of elements a fiber of a random field has in terms of a multivariate integral. We consider here parametrized systems of polynomial equations that are linear in enough parameters, and provide a Kac-Rice formula for the expected number of solutions of the system when the parameters follow continuous distributions. Combined with Monte Carlo integration, we apply the formula to partition the parameter region according to the number of solutions or find a region in parameter space where the system has the maximal number of solutions. The motivation stems from the study of steady states of chemical reaction networks and gives new tools for the open problem of identifying the parameter region where the network has at least two positive steady states. We illustrate with numerous examples that our approach successfully handles a larger number of parameters than exact methods. "], "Keywords": ["Kac-Rice Formula", "Number of Solutions", "Polynomial equation", "Multivariate integral", "Chemical Reaction Networks", "Monte Carlo Integration", "Exact Method", "Continuous Distributions"], "authors_name": ["Feliu, E.", "Sadeghimanesh, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["11 Aug 2022"]},
{"title": ["Gaussian Process Emulation of Spatio-temporal Outputs of a 2D Inland Flood Model"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/gaussian-process-emulation-of-spatio-temporal-outputs-of-a-2d-inl", "abstract": ["The computational limitations of complex numerical models have led to adoption of statistical emulators across a variety of problems in science and engineering disciplines to circumvent the high computational costs associated with numerical simulations. In flood modelling, many hydraulic and hydrodynamic numerical models, especially when operating at high spatiotemporal resolutions, have prohibitively high computational costs for tasks requiring the instantaneous generation of very large numbers of simulation results. This study examines the appropriateness and robustness of Gaussian Process (GP) models to emulate the results from a hydraulic inundation model. The developed GPs produce real-time predictions based on the simulation output from LISFLOOD-FP numerical model. An efficient dimensionality reduction scheme is developed to tackle the high dimensionality of the output space and is combined with the GPs to investigate the predictive performance of the proposed emulator for estimation of the inundation depth. The developed GP-based framework is capable of robust and straightforward quantification of the uncertainty associated with the predictions, without requiring additional model evaluations and simulations. Further, this study explores the computational advantages of using a GP-based emulator over alternative methodologies such as neural networks, by undertaking a comparative analysis. For the case study data presented in this paper, the GP model was found to accurately reproduce water depths and inundation extent by classification and produce computational speedups of approximately 10,000 times compared with the original simulator, and 80 times for a neural network-based emulator."], "Keywords": ["Flood Reaction", "Numerical models", "Simulation", "Hydraulic models", "simulation", "Neural networks", "Computer simulation", "Dimensionality reduction"], "authors_name": ["Donnelly, J.", "Abolfathi, S.", "Pearson, J.", "Chatrabgoun, O.", "Daneshkhah, A.", "Impact Evaluation of Solar Photovoltaic Electrification: Indigenous Community Case Study in Brazilian Amazon", "Trindade, A.", "Verba, N.", "Farias, N.", "Ramon, D.", "Gyamfi, K.", "da Silva, H.", "Viana, V.", "Incorporating forecasting and peer-to-peer negotiation frameworks into a distributed model predictive control approach for meshed electric networks", "Baldivieso Monasterios, P. R.", "Verba, N.", "Morris, E.", "Morstyn, T.", "Konstantopoulos, G.", "Gaura, E.", "Mcarthur, S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alireza-daneshkhah", "https://pureportal.coventry.ac.uk/en/persons/james-donnelly", "https://pureportal.coventry.ac.uk/en/persons/omid-chatrabgoun"], "publication_date": ["15 Oct 2022"]},
{"title": ["Levelwise construction of a single cylindrical algebraic cell"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/levelwise-construction-of-a-single-cylindrical-algebraic-cell", "abstract": ["Satisfiability Modulo Theories (SMT) solvers check the satisfiability of quantifier-free first-order logic formulas. We consider the theory of non-linear real arithmetic where the formulae are logical combinations of polynomial constraints. Here a commonly used tool is the Cylindrical Algebraic Decomposition (CAD) to decompose real space into cells where the constraints are truth-invariant through the use of projection polynomials.", "An improved approach is to repackage the CAD theory into a search-based algorithm: one that guesses sample points to satisfy the formula, and generalizes guesses that conflict constraints to cylindrical cells around samples which are avoided in the continuing search. Such an approach can lead to a satisfying assignment more quickly, or conclude unsatisfiability with fewer cells. A notable example of this approach is Jovanović and de Moura's NLSAT algorithm. Since these cells are produced locally to a sample we might need fewer projection polynomials than the traditional CAD projection. The original NLSAT algorithm reduced the set a little; while Brown's single cell construction reduced it much further still. However, the shape and size of the cell produced depends on the order in which the polynomials are considered.", "This paper proposes a method to construct such cells levelwise, i.e. built level-by-level according to a variable ordering. We still use a reduced number of projection polynomials, but can now consider a variety of different reductions and use heuristics to select the projection polynomials in order to optimise the shape of the cell under construction. We formulate all the necessary theory as a proof system: while not a common presentation for work in this field, it allows an elegant decoupling of heuristics from the algorithm and its proof of correctness."], "Keywords": ["Cell", "Projection", "Polynomial", "Decompose", "Guess", "Satisfiability", "Heuristics", "Proof of correctness"], "authors_name": ["Nalbach, J.", "Abraham, E.", "Specht, P.", "Brown, C.", "Davenport, J. H.", "England, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["25 Nov 2022"]},
{"title": ["From Theory to Practice: A review of co-design methods for humanitarian energy ecosystems"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/from-theory-to-practice-a-review-of-co-design-methods-for-humanit", "abstract": [], "Keywords": ["Ecosystems", "energy", "High energy electron diffraction", "typology", "Planets", "resilience", "programming", "stakeholder", "refugee", "camp", "energy", "electrification", "alternative energy"], "authors_name": ["Robinson, B. L.", "Halford, A.", "Gaura, E."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/elena-gaura", "https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["Jul 2022"]},
{"title": ["LIFT: lncRNA identification and function-prediction tool"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/lift-lncrna-identification-and-function-prediction-tool", "abstract": ["Long non-coding RNAs (lncRNAs) are a class of non-coding RNAs which play a significant role in several biological processes. Accurate identification and sub-classification of lncRNAs is crucial for exploring their characteristic functions in the genome as most coding potential computation (CPC) tools fail to accurately identify, classify and predict their biological functions in plant species. In this study, a novel computational framework called LncRNA identification and function prediction tool (LIFT) has been developed, which implements least absolute shrinkage and selection operator (LASSO) optimisation and iterative random forests classification for selection of optimal features, a novel position-based classification (PBC) method for sub-classifying lncRNAs into different classes, and a Bayesian-based function prediction approach for annotating lncRNA transcripts. Using LASSO, LIFT selected 31 optimal features and achieved a 15-30% improvement in the prediction accuracy on plant species when evaluated against state-of-the-art CPC tools. Using PBC, LIFT successfully identified the intergenic and antisense transcripts with greater accuracy in the A. thaliana and Z. mays datasets."], "Keywords": ["Long Noncoding RNA", "RNA", "Arabidopsis", "Mathematical operators", "Untranslated RNA", "Biological Phenomena", "Datasets", "Random forests"], "authors_name": ["Deshpande, S.", "Shuttleworth, J.", "Yang, J.", "Taramonli, S.", "England, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-shuttleworth", "https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["17 Jan 2022"]},
{"title": ["More than faith - Muslim-heritage children in care: Strategic Briefing"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/more-than-faith-muslim-heritage-children-in-care-strategic-briefi", "abstract": ["This briefing aims to support senior managers in meeting the needs of Muslim-heritage children and young people in care. Although it is aimed at senior leaders and managers, the content is of relevance to anyone working with Muslim-heritage children and young people.", "The briefing draws upon research and illustrative case examples, and comprises the following sections:", "Introduction and terminology", "Diversity of the Muslim faith", "The importance of cultural identity and lived religion", "Children and young people’s intersectional identities", "Overcoming challenges to meet the needs of Muslim-heritage children and young people", "How can professionals support Muslim-heritage children and young people in care, and their carers?"], "Keywords": ["faith", "Muslim", "manager", "cultural identity", "leader"], "authors_name": ["Halford, A.", "Cheruvallil-Contractor, S.", "Research in Practice "], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor"], "publication_date": ["31 May 2022"]},
{"title": ["Matrix decomposition by transforming the unit sphere to an Ellipsoid through Dilation, Rotation and Shearing"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/matrix-decomposition-by-transforming-the-unit-sphere-to-an-ellips", "abstract": ["There are various decompositions of matrices in the literature such as lower-upper, singular value and polar decompositions to name a few. In this paper we are concerned with a less standard matrix decomposition for invertible matrices of order 3 with real entries, called TRD decomposition. In this decomposition an invertible matrix is written as product of three matrices corresponding to a shear, a rotation and a dilation map that transform the unit sphere to an ellipsoid. The reason of our interest is the geometric visualization of this decomposition. We also implemented an algorithm to compute this decomposition both in Maple and Matlab."], "Keywords": ["Matrix Decomposition", "Ellipsoid", "Unit Sphere", "Dilation", "Decompose", "Invertible matrix", "Polar decomposition", "Maple"], "authors_name": ["Yang, W-C.", "Sadeghimanesh, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["19 Oct 2022"]},
{"title": ["Monte Carlo Simulation of Stochastic Differential Equation to Study Information Geometry"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/monte-carlo-simulation-of-stochastic-differential-equation-to-stu", "abstract": ["Information Geometry is a useful tool to study and compare the solutions of a Stochastic Differential Equations (SDEs) for non-equilibrium systems. As an alternative method to solving the Fokker−Planck equation, we propose a new method to calculate time-dependent probability density functions (PDFs) and to study Information Geometry using Monte Carlo (MC) simulation of SDEs. Specifically, we develop a new MC SDE method to overcome the challenges in calculating a time-dependent PDF and information geometric diagnostics and to speed up simulations by utilizing GPU computing. Using MC SDE simulations, we reproduce Information Geometric scaling relations found from the Fokker−Planck method for the case of a stochastic process with linear and cubic damping terms. We showcase the advantage of MC SDE simulation over FPE solvers by calculating unequal time joint PDFs. For the linear process with a linear damping force, joint PDF is found to be a Gaussian. In contrast, for the cubic process with a cubic damping force, joint PDF exhibits a bimodal structure, even in a stationary state. This suggests a finite memory time induced by a nonlinear force. Furthermore, several power-law scalings in the characteristics of bimodal PDFs are identified and investigated."], "Keywords": ["Information Geometry", "probability density functions", "Probability density function", "Differential equations", "Stochastic Differential Equations", "Monte Carlo Simulation", "differential equations", "Geometry"], "authors_name": ["Thiruthummal, A. A.", "Kim, E."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/e-j-kim", "https://pureportal.coventry.ac.uk/en/persons/abhiram-thiruthummal"], "publication_date": ["12 Aug 2022"]},
{"title": ["Minimizing Age of Information in Multi-hop Energy-Harvesting Wireless Sensor Network"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/minimizing-age-of-information-in-multi-hop-energy-harvesting-wire", "abstract": [], "Keywords": ["Energy harvesting", "NP-hard", "Parallel algorithms", "Wireless sensor networks", "Scheduling", "Network protocols", "Monitoring"], "authors_name": ["Chen, K.", "Benkhelifa, F.", "Gao, H.", "McCann, J.", "Li, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/fatma-benkhelifa"], "publication_date": ["9 Aug 2022"]},
{"title": ["New heuristic to choose a cylindrical algebraic decomposition variable ordering motivated by complexity analysis"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/new-heuristic-to-choose-a-cylindrical-algebraic-decomposition-var", "abstract": [" It is well known that the variable ordering can be critical to the efficiency or even tractability of the cylindrical algebraic decomposition (CAD) algorithm. We propose new heuristics inspired by complexity analysis of CAD to choose the variable ordering. These heuristics are evaluated against existing heuristics with experiments on the SMT-LIB benchmarks using both existing performance metrics and a new metric we propose for the problem at hand. The best of these new heuristics chooses orderings that lead to timings on average 17% slower than the virtual-best: an improvement compared to the prior state-of-the-art which achieved timings 25% slower. "], "Keywords": ["Decomposition", "Surface mount technology", "Experiments"], "authors_name": ["del Río, T.", "England, M.", "Springer International Publishing"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/tereso-del-r%C3%ADo-almajano"], "publication_date": ["11 Aug 2022"]},
{"title": ["Machine Learning for Computer Algebra"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/machine-learning-for-computer-algebra", "abstract": [], "Keywords": [], "authors_name": ["Barket, R.", "del Río, T.", "England, M.", "Markov Chain Monte Carlo-Based Estimation of Stress–Strength Reliability Parameter for Generalized Linear Failure Rate Distributions", "Shahsanaei, F.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/rashid-barket", "https://pureportal.coventry.ac.uk/en/persons/tereso-del-r%C3%ADo-almajano"], "publication_date": ["2022"]},
{"title": ["Multi-phase locking value: A generalized method for determining instantaneous multi-frequency phase coupling"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/multi-phase-locking-value-a-generalized-method-for-determining-in-2", "abstract": [], "Keywords": ["Biological systems", "Natural frequencies", "Dynamical systems", "Nonlinear Dynamics", "Research Subjects", "Datasets", "Biological systems", "Natural frequencies", "Dynamical systems"], "authors_name": ["Vasudeva, B.", "Tian, R.", "Wu, D. H.", "James, S. A.", "Refai, H. H.", "Ding, L.", "He, F.", "Yang, Y."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["Apr 2022"]},
{"title": ["Off the boil? The challenges of monitoring cooking behaviour in refugee settlements"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/off-the-boil-the-challenges-of-monitoring-cooking-behaviour-in-re", "abstract": ["To address the need for improved access to energy and meet the United Nations Clean Energy Challenge (2019), humanitarian agencies require robust, valid, and meaningful data that documents the everyday energy practices of displaced people. Collecting data through sensor monitoring is one way of providing quality energy data that will aid humanitarian actors in designing and delivering sustainable affordable energy solutions. Using the case of the design and deployment of 20 stove use monitors (SUM) in Kigeme refugee camp in Rwanda, this paper discusses the benefits and limitations of collecting data on cookstove usage using wireless sensors in refugee settlements., Central to the discussion is the value of reflexivity or critical reflection to uncover significant knowledge gaps that can apply more generally to the problem of designing and deploying sensor systems for the displaced setting. If sensor monitoring systems are to collect data that aid appropriate energy planning and support technology development in the humanitarian sector, we contend improvements in sensor design and deployment protocols are needed to accommodate the displaced setting's cultural, economic, and political complexity. These improvements include the uptake of sensor monitoring design that embeds ethical, progressive, and inclusive protocols when working in the displaced setting."], "Keywords": ["Cooking", "refugee", "monitoring", "energy", "Monitoring", "Sensors", "Stoves", "humanitarian aid"], "authors_name": ["Halford, A.", "Gaura, E.", "Bhargava, K.", "Verba, N.", "Brusey, J.", "Nixon, J.", "On the impact of prior distributions on efficiency of sparse Gaussian process regression", "Esmaeilbeigi, M.", "Chatrabgoun, O.", "Daneshkhah, A.", "Shafa, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/elena-gaura", "https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/jonathan-nixon"], "publication_date": ["22 Aug 2022"]},
{"title": ["On the Scalability of Duty-Cycled LoRa Networks with Imperfect SF Orthogonality"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/on-the-scalability-of-duty-cycled-lora-networks-with-imperfect-sf", "abstract": [], "Keywords": ["Scalability", "Geometry"], "authors_name": ["Bouazizi, Y.", "Benkhelifa, F.", "ElSawy, H.", "McCann, J. A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/fatma-benkhelifa"], "publication_date": ["1 Nov 2022"]},
{"title": ["Parts of Speech Tagging in NLP- an Investigation on Runtime Optimization with Quantum Formulation and ZX Calculus"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/parts-of-speech-tagging-in-nlp-an-investigation-on-runtime-optimi", "abstract": [], "Keywords": ["natural language processing", "Tagging", "Speech", "Natural Language", "calculus", "marking", "Quantum electronics", "Calculus"], "authors_name": ["Bishwas, A. K.", "Mani, A.", "Palade, V.", "Institute of Electrical and Electronics Engineers Inc."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["10 Mar 2022"]},
{"title": ["Parallel multi-swarm cooperative particle swarm optimization for protein–ligand docking and virtual screening"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/parallel-multi-swarm-cooperative-particle-swarm-optimization-for-", "abstract": ["Background: ", "A high-quality docking method tends to yield multifold gains with half pains for the new drug development. Over the past few decades, great efforts have been made for the development of novel docking programs with great efficiency and intriguing accuracy. AutoDock Vina (Vina) is one of these achievements with improved speed and accuracy compared to AutoDock4. Since it was proposed, some of its variants, such as PSOVina and GWOVina, have also been developed. However, for all these docking programs, there is still large room for performance improvement. ", "Results:", "In this work, we propose a parallel multi-swarm cooperative particle swarm model, in which one master swarm and several slave swarms mutually cooperate and co-evolve. Our experiments show that multi-swarm programs possess better docking robustness than PSOVina. Moreover, the multi-swarm program based on random drift PSO can achieve the best highest accuracy of protein–ligand docking, an outstanding enrichment effect for drug-like activate compounds, and the second best AUC screening accuracy among all the compared docking programs, but with less computation consumption than most of the other docking programs. ", "Conclusion:", "The proposed multi-swarm cooperative model is a novel algorithmic modeling suitable for protein–ligand docking and virtual screening. Owing to the existing coevolution between the master and the slave swarms, this model in parallel generates remarkable docking performance. The source code can be freely downloaded from https://github.com/li-jin-xing/MPSOVina."], "Keywords": ["Virtual Screening", "Docking", "Particle Swarm Optimization", "Swarm", "Efficiency", "Drug Development", "Screening", "Particle swarm optimization (PSO)"], "authors_name": ["Li, C.", "Li, J.", "Sun, J.", "Mao, L.", "Palade, V.", "Ahmad, B."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["30 May 2022"]},
{"title": ["On the Implementation of Cylindrical Algebraic Coverings for Satisfiability Modulo Theories Solving"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/on-the-implementation-of-cylindrical-algebraic-coverings-for-sati", "abstract": ["We recently presented cylindrical algebraic coverings: a method based on the theory of cylindrical algebraic decomposition and suited for nonlinear real arithmetic theory reasoning in Satisfiability Modulo Theories solvers. We now present a more careful implementation within cvc5, discuss some implementation details, and highlight practical benefits compared to previous approaches, i.e., NLSAT and incremental CAD. We show how this new implementation simplifies proof generation for nonlinear real arithmetic problems in cvc5 and announce some very encouraging experimental results that position cvc5 at the very front of currently available SMT solvers for QF_NRA."], "Keywords": ["Surface mount technology", "Computer aided design", "Decomposition"], "authors_name": ["Kremer, G.", "Abraham, E.", "England, M.", "Davenport, J. H."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["10 Feb 2022"]},
{"title": ["Polynomial Superlevel Set Representation of the Multistationarity Region of Chemical Reaction Networks"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/polynomial-superlevel-set-representation-of-the-multistationarity", "abstract": ["In this paper we introduce a new representation for the multistationarity region of a reaction network, using polynomial superlevel sets. The advantages of using this polynomial superlevel set representation over the formerly existing representations (cylindrical algebraic decompositions, numeric sampling, rectangular division) is discussed, and algorithms to compute this new representation are provided. The results are given for the general mathematical formalism of a parametric system of equations and therefore can be used in other application areas."], "Keywords": ["Chemical Reaction Networks", "Chemical reactions", "Sampling", "Polynomials", "Reaction Network", "Decomposition", "Set theory", "Numerics"], "authors_name": ["Sadeghimanesh, A.", "England, M.", "Predicting Primary Sequence-Based Protein-Protein Interactions Using a Mercer Series Representation of Nonlinear Support Vector Machine", "Chatrabgoun, O.", "Daneshkhah, A.", "Esmaeilbeigi, M.", "Sohrabi Safa, N.", "H. Alenezi, A.", "Rahman, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["27 Sep 2022"]},
{"title": ["Rapid Localization and Mapping Method Based on Adaptive Particle Filters"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/rapid-localization-and-mapping-method-based-on-adaptive-particle-", "abstract": ["With the development of autonomous vehicles, localization and mapping technologies have become crucial to equip the vehicle with the appropriate knowledge for its operation. In this paper, we extend our previous work by prepossessing a localization and mapping architecture for autonomous vehicles that do not rely on GPS, particularly in environments such as tunnels, under bridges, urban canyons, and dense tree canopies. The proposed approach is of two parts. Firstly, a K-means algorithm is employed to extract features from LiDAR scenes to create a local map of each scan. Then, we concatenate the local maps to create a global map of the environment and facilitate data association between frames. Secondly, the main localization task is performed by an adaptive particle filter that works in four steps: (a) generation of particles around an initial state (provided by the GPS); (b) updating the particle positions by providing the motion (translation and rotation) of the vehicle using an inertial measurement device; (c) selection of the best candidate particles by observing at each timestamp the match rate (also called particle weight) of the local map (with the real-time distances to the objects) and the distances of the particles to the corresponding chunks of the global map; (d) averaging the selected particles to derive the estimated position, and, finally, using a resampling method on the particles to ensure the reliability of the position estimation. The performance of the newly proposed technique is investigated on different sequences of the Kitti and Pandaset raw data with different environmental setups, weather conditions, and seasonal changes. The obtained results validate the performance of the proposed approach in terms of speed and representativeness of the feature extraction for real-time localization in comparison with other state-of-the-art methods."], "Keywords": ["filters", "Weather", "Environment", "vehicles", "Autonomous vehicles", "Global positioning system", "Technology", "Weights and Measures"], "authors_name": ["Charroud, A.", "El Moutaouakil, K.", "Yahyaouy, A.", "Onyekpe, U.", "Palade, V.", "Huda, M. N."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["2 Dec 2022"]},
{"title": ["Predicting the Public Adoption of Connected and Autonomous Vehicles"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/predicting-the-public-adoption-of-connected-and-autonomous-vehicl", "abstract": ["Connected and Autonomous Vehicles (CAV) are gaining increasing importance due to the current needs of modern society for better mobility and societal impact. CAV development and adoption will be driven by Artificial Intelligence (AI) and 5G/6G technologies which will offer increased speed, reduced latency and ubiquity. However, the public is concerned with the concept of handing total control of driving to vehicles. These concerns will inhibit the adoption of CAVs when they become available to the public. In this paper, we investigated user adoption of CAVs by collecting quantitative data from potential users based on their preference and inherent concerns towards adoption. We conducted a statistical analysis and applied machine learning techniques to predict the user adoption for CAVs. Our results show that several machine learning approaches were effective in forecasting user adoption for CAVs. We have employed Neural Networks, Random Forest, Naïve Bayes and Fuzzy Logic based models and achieved accuracies of 81.76%, 83.63%, 82.15% and 86.38, respectively, in forecasting the public adoption of CAV."], "Keywords": ["Autonomous vehicles", "Machine learning", "Random forests", "Artificial intelligence", "Fuzzy logic", "Statistical methods", "Neural networks"], "authors_name": ["Ahmed, M. L.", "Iqbal, R.", "Karyotis, C.", "Palade, V.", "Amin, S. A.", "Privacy Enhancing Technologies (PETs) for Connected Vehicles in Smart Cities", "Sohrabi Safa, N.", "Mitchell, F.", "Maple, C.", "Azad, M. A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/mohammed-ahmed", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["1 Feb 2022"]},
{"title": ["RDPSOVina: the random drift particle swarm optimization for protein-ligand docking"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/rdpsovina-the-random-drift-particle-swarm-optimization-for-protei", "abstract": ["Protein-ligand docking is of great importance to drug design, since it can predict the binding affinity between ligand and protein, and guide the synthesis direction of the lead compounds. Over the past few decades, various docking programs have been developed, some of them employing novel optimization algorithms. However, most of those methods cannot simultaneously achieve both good efficiency and accuracy. Therefore, it is worthwhile to pour the efforts into the development of a docking program with fast speed and high quality of the solutions obtained. The research presented in this paper, based on the docking scheme of Vina, developed a novel docking program called RDPSOVina. The RDPSOVina employes a novel search algorithm but the same scoring function of Vina. It utilizes the random drift particle swarm optimization (RDPSO) algorithm as the global search algorithm, implements the local search with small probability, and applies Markov chain mutation to the particles' personal best positions in order to harvest more potential-candidates. To prove the outstanding docking performance in RDPSOVina, we performed the re-docking experiments on two PDBbind datasets and cross-docking experiments on the Sutherland-crossdock-set, respectively. The RDPSOVina exhibited superior protein-ligand docking accuracy and better cross-docking prediction with higher operation efficiency than most of the compared methods. It is available at https://github.com/li-jin-xing/RDPSOVina . [Abstract copyright: © 2022. The Author(s), under exclusive licence to Springer Nature Switzerland AG.]"], "Keywords": ["Ligands", "ligands", "Proteins", "Mutation", "Particle swarm optimization (PSO)", "proteins", "Kd", "optimization"], "authors_name": ["Li, J.", "Li, C.", "Sun, J.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Jun 2022"]},
{"title": ["SC-Square: Future Progress with Machine Learning"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/sc-square-future-progress-with-machine-learning", "abstract": ["The algorithms employed by our communities are often underspecified, and thus have multiple implementation choices, which do not effect the correctness of the output, but do impact the efficiency or even tractability of its production.  ", "In this extended abstract, to accompany a keynote talk at the 2021 SC-Square Workshop, we survey recent work (both the author's and from the literature) on the use of Machine Learning technology to improve algorithms of interest to SC-Square."], "Keywords": ["Machine learning"], "authors_name": ["England, M.", "CEUR Workshop Proceedings"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["14 Nov 2022"]},
{"title": ["Saving Research Budgets by Improving Algebraic Tools for the Study of Population Dynamics"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/saving-research-budgets-by-improving-algebraic-tools-for-the-stud", "abstract": [], "Keywords": [], "authors_name": ["Sadeghimanesh, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["7 Mar 2022"]},
{"title": ["The benefits of clustering in cylindrical algebraic decomposition"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-benefits-of-clustering-in-cylindrical-algebraic-decomposition", "abstract": ["Cylindrical Algebraic Decomposition (CAD) is a very powerful algorithm with many potential applications, however, its doubly exponential complexity limits its usability. In this document we demonstrate how the techniques of adjacency and clustering would reduce the double exponent of CAD complexity."], "Keywords": ["Decomposition"], "authors_name": ["del Río, T.", "England, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/tereso-del-r%C3%ADo-almajano"], "publication_date": ["2022"]},
{"title": ["Resilient Consensus Control Design for DC Microgrids against False Data Injection Attacks Using a Distributed Bank of Sliding Mode Observers"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/resilient-consensus-control-design-for-dc-microgrids-against-fals", "abstract": ["This paper investigates the problem of false data injection attack (FDIA) detection in microgrids. The grid under study is a DC microgrid with distributed boost converters, where the false data are injected into the voltage data so as to investigate the effect of attacks. The proposed algorithm uses a bank of sliding mode observers that estimates the states of the neighbor agents. Each agent estimates the neighboring states and, according to the estimation and communication data, the detection mechanism reveals the presence of FDIA. The proposed control scheme provides resiliency to the system by replacing the conventional consensus rule with attack-resilient ones. In order to evaluate the efficiency of the proposed method, a real-time simulation with eight agents has been performed. Moreover, a verification experimental test with three boost converters has been utilized to confirm the simulation results. It is shown that the proposed algorithm is able to detect FDI attacks and it protects the consensus deviation against FDI attacks."], "Keywords": ["attack", "Microgrids", "sliding", "direct current", "injection", "Simulation", "Injections", "Communication"], "authors_name": ["Barzegari, Y.", "Zarei, J.", "Razavi-Far, R.", "Saif, M.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["30 Mar 2022"]},
{"title": ["Switching Trackers for Effective Sensor Fusion in Advanced Driver Assistance Systems"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/switching-trackers-for-effective-sensor-fusion-in-advanced-driver", "abstract": [], "Keywords": ["Advanced driver assistance systems", "Fusion reactions", "Sensors", "Traffic signs", "Crosswalks", "Extended Kalman filters", "Gages", "Kalman filters"], "authors_name": ["Deo, A.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/ankur-deo"], "publication_date": ["3 Nov 2022"]},
{"title": ["The practice of AI and ethics in energy transition futures"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-practice-of-ai-and-ethics-in-energy-transition-futures", "abstract": ["With greater implementation of Artificial Intelligence (AI) and big data as part of the transition towards digitalisation of the UK energy sector, there is a need for greater clarity around how ethics and ethical practices are understood and applied by stakeholders.", "The UK Energy Sector is undergoing a significant shift towards digitalisation. Increased use of AI, whilst improving safety, productivity, and sustainability of energy systems, will become increasingly complex with high computational demands. This raises ethical concerns around issues such as security and privacy. While there is a strong culture of regulatory compliance, there is a significantly less established understanding of ethical practices and frameworks in the UK energy sector.", "This briefing paper details work conducted by EnergyREV researchers exploring understanding and experience of ethics and AI, as the sector moves towards greater employment of technology in the data collection, storage and use processes. By addressing ethical concerns from the outset, taking a proactive rather than reactive approach, risks can be mitigated, and potential issues addressed early on, leading to more opportunities for technological advancement and innovation.", "Through engagement with energy actors, an understanding of how ethics is applied by those working in the energy data sector will be improved"], "Keywords": ["ethics", "artificial intelligence", "transition", "energy", "storage (process)", "compliance", "innovation", "stakeholder"], "authors_name": ["Morris, E.", "Stamp, K.", "Halford, A.", "Gaura, E.", "University of Strathclyde"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/elena-gaura", "https://pureportal.coventry.ac.uk/en/persons/kathryn-stamp", "https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["4 Jul 2022"]},
{"title": ["SC-Square: Overview to 2021."], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/sc-square-overview-to-2021", "abstract": ["This extended abstract was written to accompany an invited talk at the 2021 SC-Square Workshop, where the author was asked to give an overview of SC-Square progress to date.  The author first reminds the reader of the definition of SC-Square, then briefly outlines some of the history, before picking out some (personal) scientific highlights."], "Keywords": ["History", "Reader"], "authors_name": ["England, M.", "CEUR Workshop Proceedings", "Stable likelihood computation for machine learning of linear differential operators with Gaussian processes", "Chatrabgoun, O.", "Esmaeilbeigi, M.", "Cheraghi, M.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["14 Nov 2022"]},
{"title": ["The politics of Matching: Ethnicity, Religion and Muslim-heritage Children in Care in the UK"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-politics-of-matching-ethnicity-religion-and-muslim-heritage-c", "abstract": ["In 2014, in order to improve outcomes for children from ethnic minority backgrounds and to speed up the adoption process, the UK government changed the Children and Families Act. The legal requirement on adoption agencies to consider ethnicity in the decision around 'matching' was removed, thus clearing the way for transracial placements. This article interrogates the impact of the change in law on social work practice around adoption, using the experiences of diverse Muslim-heritage children as a case study. Grounded in the sociology of religion, the findings presented here are based on semi-structured qualitative interviews (n=28) with those involved in the care of Muslim-heritage children. In discussing qualitative findings, all adopters and prospective adopters interviewed in this research insisted on adopting children who 'look like them', and social workers continued to look for the 'best' possible matches. Children from minoritised backgrounds continue to wait for long periods before finding permanent homes. Our evidence raises questions about the efficacy of policy guidance. Based on this evidence we conclude that greater strategizing is needed around the recruitment of adopters from diverse backgrounds."], "Keywords": ["Islam", "Politics", "Religion", "Child Care", "Muslim", "ethnicity", "politics", "Child", "Islam", "Well-being", "Heritage", "Muslims", "Carers", "Muslim", "faith", "adoptive parents", "social worker", "adopted child"], "authors_name": ["Cheruvallil-Contractor, S.", "Halford, A.", "Boti Phiri, M. J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor"], "publication_date": ["1 Dec 2022"]},
{"title": ["Transfer Learning based Classification of Diabetic Retinopathy on the Kaggle EyePACS dataset"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/transfer-learning-based-classification-of-diabetic-retinopathy-on", "abstract": ["Severe stages of diabetes can eventually lead to an eye condition", "called diabetic retinopathy. It is one of the leading causes of temporary visual disability and permanent blindness. There is no cure for this disease other than a proper treatment in the early stages. Five stages of diabetic retinopathy are discussed in this paper that need to be detected followed by a proper treatment. Transfer learning is used to detect the grades of diabetic retinopathy in eye fundus images, without training from scratch. The Kaggle EyePACS dataset is one of the largest datasets", "available publicly for experimentation. In our work, an extensive study on the Kaggle EyePACS dataset is carried out using pre-trained models ResNet50 and DenseNet121. The Aptos dataset is also used in comparison with this dataset to examine the performance of the pre-trained models. Different experiments are performed to analyze the images from the different classes in the Kaggle EyePACS dataset. This dataset has significant challenges including image noise, imbalanced classes, and fault annotations. Our work highlights potential problems within the dataset", "and the conflicts between the classes. A clustering technique is used to get informative images from the normal class to improve the model’s accuracy to 70%."], "Keywords": ["Transfer learning", "Medical problems", "Experiments"], "authors_name": ["Tariq, M.", "Palade, V.", "Ma, Y."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/maria-tariq", "https://pureportal.coventry.ac.uk/en/persons/yingliang-ma"], "publication_date": ["15 Nov 2022"]},
{"title": ["Using Physics-informed Neural Networks to Model the Hydro-morphodynamics of Mangrove Environments"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/using-physics-informed-neural-networks-to-model-the-hydro-morphod", "abstract": [], "Keywords": [], "authors_name": ["Fanous, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/majdi-fanous"], "publication_date": ["9 Dec 2022"]},
{"title": ["Using Machine Learning in SC2"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/using-machine-learning-in-sc2", "abstract": ["This talk exposes many possible uses of Machine Learning (ML) in the context of SC2, and how this approach differs from human-made heuristics. Different ML paradigms are presented and it is discussed how symbolic data could be encoded. This talk also intends to motivate a discussion about which datasets should be used for training and testing ML models."], "Keywords": ["Machine learning", "Testing"], "authors_name": ["del Río, T."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/tereso-del-r%C3%ADo-almajano"], "publication_date": ["23 Aug 2022"]},
{"title": ["Using multi-objective optimisation with ADM1 and measured data to improve the performance of an existing anaerobic digestion system"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/using-multi-objective-optimisation-with-adm1-and-measured-data-to", "abstract": ["This paper presents a method to model and optimise the substrate feeding rate of an anaerobic digestion (AD) system. The method is demonstrated for a case study plant in Bangalore, India, using onsite kitchen waste to provide biogas for cooking. The AD system is modelled using Anaerobic Digestion Model No. 1 (ADM1) and a genetic algorithm (GA) is applied to control the substrate feeding rate in order to simultaneously minimise the volume of flared biogas, unmet gas demand and energy cost. Our results show that ADM1 can predict biogas yield from a continuously operated digester well with mean percentage error between daily predicted and measured data values of only 5.7% for March 2017 and 17.8% for July 2017. When biogas flaring and unmet gas demand were minimised, the amount of biogas flared reduced from 886.62 m", " to 88.87 m", " in March and from 73.79 m", " to 68.49 m", " in July. When the energy cost was also considered within an objective function, the biogas flared reduced from 886.62 m", " to 281.27 m", " for March, but increased from 73.79 m", " to 180.11 m", " for July. The amount of flaring increased in July as the energy cost function increased biogas yield without considering surplus gas production beyond demand and storage capacity. As AD systems are often operated to maximise biogas production, these results highlight the need for multi-objective optimisation, particularly for off-grid AD systems."], "Keywords": ["Biofuels", "Anaerobic digestion", "Biogas", "anaerobic digestion", "biogas", "Multiobjective optimization", "Digestion", "demand"], "authors_name": ["Ashraf, R. J.", "Nixon, J. D.", "Brusey, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/jonathan-nixon", "https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/rjaa-jawad-ashraf"], "publication_date": ["Aug 2022"]},
{"title": ["Trustworthiness of systematic review automation: An Interview at Coventry University"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/trustworthiness-of-systematic-review-automation-an-interview-at-c", "abstract": [], "Keywords": [], "authors_name": ["Jiang, X.", "Using Machine Learning for Anomaly Detection on a System-on-Chip under Gamma Radiation", "Wachter, E. W.", "Kasap, S.", "Kolozali, S.", "Zhai, X.", "Ehsan, S.", "McDonald-Maier, K.", "Using Machine Learning for Anomaly Detection on a System-on-Chip under Gamma Radiation", "Wächter, E. W.", "Kasap, S.", "Kolozali, Ş.", "Zhai, X.", "Ehsan, S.", "McDonald-Maier, K. D."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["2022"]},
{"title": ["Adversarial Learning on Incomplete and Imbalanced Medical Data for Robust Survival Prediction of Liver Transplant Patients"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/adversarial-learning-on-incomplete-and-imbalanced-medical-data-fo", "abstract": [], "Keywords": ["Transplants", "Liver", "Deep learning", "Health", "Machine learning", "Decision making"], "authors_name": ["Hallaji, E.", "Razavi-Far, R.", "Palade, V.", "Saif, M.", "A full-parallel implementation of Self-Organizing Maps on hardware", "Dias, L. A.", "Damasceno, A. M. P.", "Gaura, E.", "Fernandes, M. A. C."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["24 May 2021"]},
{"title": ["Word representation using refined contexts"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/word-representation-using-refined-contexts", "abstract": [], "Keywords": ["Refining", "Decomposition", "Semantics"], "authors_name": ["Zhang, M.", "Palade, V.", "Wang, Y.", "Ji, Z.", "Access Point Selection Strategies for Indoor 5G Millimeter-Wave Distributed Antenna Systems", "Zhang, L.", "Cotton, S.", "Yoo, S. K.", "Fernandez, M.", "Scanlon, W."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Sep 2022"]},
{"title": ["A hybrid framework for brain tissue segmentation in magnetic resonance images"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-hybrid-framework-for-brain-tissue-segmentation-in-magnetic-reso", "abstract": [], "Keywords": ["Magnetic Resonance", "Magnetic resonance", "Tissue", "Brain", "Image segmentation", "Particle swarm optimization (PSO)", "Relaxation", "Image processing"], "authors_name": ["Li, C.", "Sun, J.", "Liu, L.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Dec 2021"]},
{"title": ["A hybrid framework for detecting and eliminating cyber-attacks in power grids"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-hybrid-framework-for-detecting-and-eliminating-cyber-attacks-in", "abstract": [], "Keywords": ["Unsupervised Learning", "Attack", "Power System", "State Estimation", "Electric power systems", "Kalman Filter", "Grid", "Unsupervised learning"], "authors_name": ["Aflaki, A.", "Gitizadeh, M.", "Razavi-Far, R.", "Palade, V.", "Ghasemi, A. A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["15 Sep 2021"]},
{"title": ["Analysis of standalone solar streetlights for improved energy access in displaced settlements"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/analysis-of-standalone-solar-streetlights-for-improved-energy-acc", "abstract": ["This paper examines the gap between the design and in-situ performance of solar streetlight interventions in two humanitarian settings. Displaced settlements often lack street lighting and electricity. Given that off-grid solar streetlights produce surplus energy, we hypothesized that this energy could be made available for daily usage, to improve system performance and provide further energy access to displaced populations. We recognize, however, that solar streetlight performance and longevity have typically been poor in remote and refugee settings. Eleven solar streetlights were fitted with ground-level sockets and their performance monitored, in two displaced settlements: a refugee camp in Rwanda and an internally displaced population settlement in Nepal. Considerable performance gaps were found across all eleven systems. Inefficient lights and mismatching system components were major issues at both sites, reducing targeted designed performance ratios by 33% and 53% on average in Rwanda and Nepal, respectively. The challenges of deploying these types of systems in temporary settlements are outlined and a number of suggestions are made to guide future developments in the design and implementation of sustainable solar streetlight interventions."], "Keywords": ["Street lighting", "Electricity"], "authors_name": ["Nixon, J.", "Bhargava, K.", "Halford, A.", "Gaura, E."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/jonathan-nixon", "https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/elena-gaura"], "publication_date": ["Nov 2021"]},
{"title": ["An Empirical Study of Span Modeling in Science NER"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-empirical-study-of-span-modeling-in-science-ner", "abstract": [], "Keywords": ["Empirical Study", "Named Entity Recognition", "Modeling", "Context", "Encoding", "Evaluation", "Range of data", "Performance"], "authors_name": ["Jiang, X.", "Springer"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["7 Sep 2021"]},
{"title": ["A Jump-Markov Regularized Particle Filter for the estimation of ambiguous sensor faults"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-jump-markov-regularized-particle-filter-for-the-estimation-of-a", "abstract": ["Sensor or actuator faults occurring on a Unmanned Aerial Vehicle (UAV) can compromise the system integrity.", "Fault diagnosis methods is then becoming a required feature for those systems.", "In this paper, the focus is on fault estimation for a fixed-wing UAVs in the presence of simultaneous sensor faults.", "The altitude measurements of a UAV are commonly obtained from the combination of two different types of sensors: a Global Navigation Satellite System (GNSS) receiver and a barometer.", "Both sensors are subject to additive abrupt faults.", "To deal with the multimodal nature of the faulty modes, a Jump-Markov Regularized Particle Filter (JMRPF) is proposed in this paper to estimate the barometric altitude and GNSS altitude measurement faults, including the case when both faults occur simultaneously.", "This method is based on a regularization step that improves the robustness thanks to the approximation of the conditional density by a kernel mixture.", "In addition, the new jump strategy estimates the correct failure mode in 100% of the 100 simulations performed in this paper.", "This approach is compared with an Interacting Multiple Model Kalman Filter (IMM-KF) and the results show that the JMRPF outperforms the IMM-KF approach, particularly in the ambiguous case when both sensors are simultaneously subject to additive abrupt faults."], "Keywords": ["Unmanned aerial vehicles (UAV)", "Sensors", "Kalman filters", "Satellites", "Barometers", "Navigation", "Fixed wings", "Failure modes"], "authors_name": ["Iglésis, E.", "Dahia, K.", "Piet-Lahanier, H.", "Merlinge, N. J. A.", "Horri, N.", "Brusey, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/nadjim-horri"], "publication_date": ["14 Apr 2021"]},
{"title": ["A Quaternion Gated Recurrent Unit Neural Network for Sensor Fusion"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-quaternion-gated-recurrent-unit-neural-network-for-sensor-fusio", "abstract": ["Recurrent Neural Networks (RNNs) are known for their ability to learn relationships within temporal sequences. Gated Recurrent Unit (GRU) networks have found use in challenging time-dependent applications such as Natural Language Processing (NLP), financial analysis and sensor fusion due to their capability to cope with the vanishing gradient problem. GRUs are also known to be more computationally efficient than their variant, the Long Short-Term Memory neural network (LSTM), due to their less complex structure and as such, are more suitable for applications requiring more efficient management of computational resources. Many of such applications require a stronger mapping of their features to further enhance the prediction accuracy. A novel Quaternion Gated Recurrent Unit (QGRU) is proposed in this paper, which leverages the internal and external dependencies within the quaternion algebra to map correlations within and across multidimensional features. The QGRU can be used to efficiently capture the inter- and intra-dependencies within multidimensional features unlike the GRU, which only captures the dependencies within the sequence. Furthermore, the performance of the proposed method is evaluated on a sensor fusion problem involving navigation in Global Navigation Satellite System (GNSS) deprived environments as well as a human activity recognition problem. The results obtained show that the QGRU produces competitive results with almost 3.7 times fewer parameters compared to the GRU. The QGRU code is available at https://github.com/onyekpeu/Quarternion-Gated-Recurrent-Unit."], "Keywords": ["Fusion reactions", "Neural networks", "Sensors", "Navigation", "Long short-term memory", "Algebra", "Recurrent neural networks", "Satellites"], "authors_name": ["Onyekpe, U. A.", "Palade, V.", "Kanarachos, S.", "Christopoulos, S.", "A Review on Collision Avoidance Systems for Unmanned Aerial Vehicles", "Dushime, K.", "Nkenyereye, L.", "Yoo, S.", "Song, J. S.", "A survey of empirical performance evaluation of permissioned blockchain platforms: Challenges and opportunities", "Dabbagh, M.", "Choo, K-K. R.", "Beheshti, A.", "Tahir, M.", "Sohrabi Safa, N.", "A Time Series Based Study of Correlation, Channel Power Imbalance and Diversity Gain in Indoor Distributed Antenna Systems at 60 GHz", "Zhang, L.", "Cotton, S.", "Yoo, S. K.", "Ngo, H.", "Fernandez, M.", "Scanlon, W."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/stavros-christopoulos", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["9 Mar 2021"]},
{"title": ["An Improved Fuzzy Knowledge-Based Model For Long Stay Container Yards"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/an-improved-fuzzy-knowledge-based-model-for-long-stay-container-y", "abstract": ["This paper considers the problem of allocating newly arrived containers to stacks of existing containers in a yard  when the departure date/time for containers is unknown. Many factors and constraints need to be considered  when modelling this storage allocation problem. These constraints include the size, type and weight of the  containers. The factors are the number of containers in a stack and the duration of stay of the topmost container  in the stack. This paper aims to develop an improved Fuzzy Knowledge-Based ‘FKB’ model for best allocation ", "practice of long-stay containers in a yard. In this model, the duration of stay factor does not need to be considered  in the allocation decision if the duration of stay for the topmost containers in a stack is similar; hence, a new  ‘ON/OFF’ strategy is proposed within the Fuzzy Knowledge-Based model to activate/deactivate this factor in the  stacking algorithm whenever is required. Discrete Event Simulation and Fuzzy Knowledge-Based techniques are used to develop the proposed model. The model’s behaviour is tested using three real-life scenarios, including  allocating containers in busy, moderately busy and quiet yards. The total number of re-handlings, the number of re-handlings per stack, and the number of re-handlings for containers were considered KPIs in each scenario. "], "Keywords": ["Containers", "Discrete event simulation"], "authors_name": ["Al Bazi, A.", "Palade, V.", "Al-Hadeethi, R.", "Abbas, A.", "A probabilistic predictive model for assessing the economic reusability of load-bearing building components: Developing a Circular Economy framework", "Rakhshanbabanari, K.", "Morel, J-C.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/ammar-al-bazi"], "publication_date": ["10 Jun 2021"]},
{"title": ["A New Fuzzy Knowledge-Based Optimisation System for Management of Container Yard Operations"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-new-fuzzy-knowledge-based-optimisation-system-for-management-of", "abstract": ["Managing the container yard operations can be challenging as a result of various uncertainties associated with storing and retrieving containers from the yard. These associated uncertainties occur because the arrival of a truck to pick up the container is random, so the departure time of the container is unknown. The problem investigated in this paper emerges when newly arrived containers of different sizes, types and weights require storage operation in the same yard where other containers have already been stored. This situation becomes more challenging when the time of departure of existing container is not known. This study develops a new Fuzzy Knowledge-Based optimisation system named ‘FKB_GA’ for optimal storage and retrieval of containers in a yard that contains long stay pre-existing containers. The containers’ duration of stay factor is considered along with two other factors such as the similarity (containers with same customer) and the quantity of containers per stack.", "A new Multi-Layered Genetic Algorithm module is proposed which identifies the optimal fuzzy rules required for each set of fired rules to achieve a minimum number of container re-handlings when selecting a stack. An industrial case study is used to demonstrate the applicability and practicability of the developed system. "], "Keywords": ["Containers", "Uncertainty", "Fuzzy rules", "Trucks", "Genetic algorithms", "Set theory"], "authors_name": ["Al Bazi, A.", "Palade, V.", "Abbas, A. H. H. J.", "A New Method for Semi-Supervised Segmentation of Satellite Images", "Sharifzadeh, S.", "Amiri, S.", "Abdi Jalebi, S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/ammar-al-bazi"], "publication_date": ["26 Mar 2021"]},
{"title": ["Bispectrum-based Cross-frequency Functional Connectivity: A Study of Alzheimer’s Disease"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/bispectrum-based-cross-frequency-functional-connectivity-a-study-", "abstract": ["Alzheimer’s disease (AD) is a neurodegenerative disorder known to affect functional connectivity (FC) across many brain regions. Linear FC measures have been applied to study the differences in AD by splitting neurophysiological signals such as electroencephalography (EEG) recordings into discrete frequency bands and analysing them in isolation from each other. We address this limitation by quantifying cross-frequency FC in addition to the traditional within-band approach. Cross-bispectrum, a higher-order spectral analysis approach, is used to measure the nonlinear FC and is compared with the cross-spectrum, which only measures the linear FC within bands. This work reports the first use of cross-bispectrum to reconstruct a cross-frequency FC network where each frequency band is treated as a layer in a multilayer network with both inter- and intra-layer edges. An increase of within-band FC in AD is observed in low-frequency bands using both methods. Bispectrum also detects multiple cross-frequency differences, mainly increased FC in AD in delta-theta coupling. An increased importance of low-frequency coupling and decreased importance of high-frequency coupling is observed in AD. Integration properties of AD networks are more vulnerable than HC, while the segregation property is maintained in AD. Moreover, the segregation property of γ is less vulnerable in AD, suggesting the shift of importance from high-frequency activity towards low-frequency components. The results highlight the importance of studying nonlinearity and including cross-frequency FC in characterising AD. Moreover, the results demonstrate the advantages and limitations of using bispectrum to reconstruct FC networks."], "Keywords": ["Frequency bands", "Spectrum analysis", "Multilayers", "Electroencephalography", "Brain"], "authors_name": ["Klepl, D.", "He, F.", "Wu, M.", "Blackburn, D. J.", "Sarrigiannis, P. G.", "bioRxiv", "Blockchain and smart contract for access control in healthcare: A survey, issues and challenges, and open issues", "Sookhak, M.", "Jabbarpour, M. R.", "Sohrabi Safa, N.", "Yu, F. R."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/dominik-klepl", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["8 Aug 2021"]},
{"title": ["CSI-COP - 'Your Right to Privacy Online'"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/csi-cop-your-right-to-privacy-online", "abstract": [], "Keywords": [], "authors_name": ["Shah, H.", "Winter, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/jaimz-winter", "https://pureportal.coventry.ac.uk/en/persons/huma-shah"], "publication_date": ["2021"]},
{"title": ["Characterising Alzheimer's Disease with EEG-based Energy Landscape Analysis"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/characterising-alzheimers-disease-with-eeg-based-energy-landscape", "abstract": ["Alzheimer's disease (AD) is one of the most common neurodegenerative diseases, with around 50 million patients worldwide. Accessible and non-invasive methods of diagnosing and characterising AD are therefore urgently required. Electroencephalography (EEG) fulfils these criteria and is often used when studying AD. Several features derived from EEG were shown to predict AD with high accuracy, e.g. signal complexity and synchronisation. However, the dynamics of how the brain transitions between stable states have not been properly studied in the case of AD and EEG data. Energy landscape analysis is a method that can be used to quantify these dynamics. This work presents the first application of this method to both AD and EEG. Energy landscape assigns energy value to each possible state, i.e. pattern of activations across brain regions. The energy is inversely proportional to the probability of occurrence. By studying the features of energy landscapes of 20 AD patients and 20 healthy age-matched counterparts, significant differences were found. The dynamics of AD patients' brain networks were shown to be more constrained - with more local minima, less variation in basin size, and smaller basins. We show that energy landscapes can predict AD with high accuracy, performing significantly better than baseline models. "], "Keywords": ["Electroencephalography", "Brain", "Neurodegenerative diseases", "Chemical activation", "Synchronization"], "authors_name": ["Klepl, D.", "He, F.", "Wu, M.", "Blackburn, D. J.", "Marco, M. D.", "Sarrigiannis, P.", "arXiv", "Critical behavior of magnetic polymers in two and three dimensions", "Foster, D. P.", "Majumdar, D."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/dominik-klepl", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["19 Feb 2021"]},
{"title": ["Building Capacity: HEED Skills Audit and Recommendations:  HEED Skills Audit and Recommendations"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/building-capacity-heed-skills-audit-and-recommendations-heed-skil", "abstract": ["This report aims to explore how HEED approached and delivered capacity building for the research team, project partners and the communities the team worked within Rwanda and Nepal.[i] This report’s purpose is threefold: first, to be evidential on how HEED planned, delivered and captured impact around capacity building so similar projects can develop best practice when skills development is a key deliverable. Second, to encourage other energy projects to document the impact produced by researchers and practitioners’ involvement while working with communities. Therefore, to recognise the tacit and dynamic aspects of knowledge production, not only the more explicit aspects. Third, suggest recommendations to support a skills-led approach to capacity building that provides personal and professional development opportunities to deepen knowledge production and impact."], "Keywords": ["audit", "knowledge production", "Rwanda", "Nepal", "best practice", "energy", "refugee", "camp", "energy", "electrification", "alternative energy"], "authors_name": ["Halford, A.", "Coventry University"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["24 Mar 2021"]},
{"title": ["Centralised and decentralised sensor fusion‐based emergency brake assist"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/centralised-and-decentralised-sensor-fusionbased-emergency-brake-", "abstract": [], "Keywords": ["brakes", "emergencies", "Brakes", "Emergencies", "Error", "sensors", "Fusion reactions", "Sensors"], "authors_name": ["Deo, A.", "Palade, V.", "Huda, M. N."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/ankur-deo"], "publication_date": ["11 Aug 2021"]},
{"title": ["Diversity collaboratively guided random drift particle swarm optimization"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/diversity-collaboratively-guided-random-drift-particle-swarm-opti", "abstract": ["The random drift particle swarm optimization (RDPSO) algorithm is an effective random search technique inspired by the trajectory analysis of the canonical PSO and the free electron model in metal conductors placed in an external electric field. However, like other PSO variants, the RDPSO algorithm also inevitably encounters premature convergence when solving multimodal problems. To address this issue, this paper proposes a novel diversity collaboratively guided (DCG) strategy for the RDPSO algorithm that enhances the search ability of the algorithm. In this strategy, two kinds of diversity measures are defined and modified in a collaborative manner. Specifically, the whole search process of the RDPSO is divided into three phases based on the changes in the two diversity measures. In each phase, different values are selected for the key parameters of the update equation in the RDPSO to make the particle swarm perform different search modes. Consequently, the improved RDPSO algorithm with the DCG strategy (DCG-RDPSO) can maintain its diversity dynamically at a certain level, and thus can search constantly without stagnation until the search process terminates. The performance evaluation of the proposed algorithm is done on the CEC-2013 benchmark suite, in comparison with several versions of RDPSO, different variants of PSO and several non-PSO evolutionary algorithms. Experimental results show that the proposed DCG strategy can significantly improve the performance and robustness of the RDPSO algorithm for most of the multimodal problems. Further experiments on economic dispatch problems also verify the effectiveness of the DCG strategy."], "Keywords": ["Particle swarm optimization (PSO)", "Electrons", "Electric fields", "Evolutionary algorithms", "Trajectories", "Metals", "Economics", "Experiments"], "authors_name": ["Li, C.", "Sun, J.", "Palade, V.", "Li, L-W."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["13 Jul 2021"]},
{"title": ["Cell site analysis; use and reliability of survey methods"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/cell-site-analysis-use-and-reliability-of-survey-methods", "abstract": ["An RF Survey may form part of a wider forensic strategy. The purpose of a survey within this strategy, and the manner in which survey data may be used to better inform evaluative or investigative opinion, is discussed. Hazards of using survey results in isolation of other information to produce a series of piecemeal technical observations (in isolation of each other and the wider purpose of the examination) are explored. Technical issues concerning measuring a complex radio environment, and methods to address those issues, are presented. Experiments comparing CDR (“ground truth” data) from a known location is compared to survey measurements focussed on that location. The performance of methods using engineering handset survey devices (Anite Nemo) is compared with that of Software Controlled Radio (QRC ICS-500) for these trial data. Assessments of uncertainty within the methods tested are made, including accuracy, precision and reliability."], "Keywords": ["Radio", "radio", "social isolation", "Uncertainty", "Hazards", "Software", "uncertainty", "software"], "authors_name": ["Tart, M. S.", "Brodie, I.", "Patrick-Gleed, N.", "Edwards, B.", "Weeks, K.", "Moore, R.", "Haseler, R."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-stephen-tart"], "publication_date": ["Sep 2021"]},
{"title": ["Deciding the consistency of non-linear real arithmetic constraints with a conflict driven search using cylindrical algebraic coverings"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/deciding-the-consistency-of-non-linear-real-arithmetic-constraint", "abstract": [], "Keywords": ["Conflict", "Covering", "Satisfiability", "Decomposition", "Input Constraints", "Polynomials", "Partial", "Decompose"], "authors_name": ["Ábrahám, E.", "Davenport, J. H.", "England, M.", "Kremer, G."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["Feb 2021"]},
{"title": ["CSI-COP Policy Brief 1: How Citizen Science Can Add Value to Investigate Compliance of the General Data Protection Regulation (GDPR). "], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/csi-cop-policy-brief-1-how-citizen-science-can-add-value-to-inves", "abstract": ["Online tracking is out of control. The first policy brief in the EU Horizon2020 funded CSI-COP project recommends that EU funded projects should be required to set-up privacy-by design project websites and/or apps with tracking made transparent, especially by any third-party."], "Keywords": ["Privacy by design", "Data privacy", "Application programs", "Compliance", "Websites"], "authors_name": ["Shah, H."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/huma-shah"], "publication_date": ["30 Mar 2021"]},
{"title": ["DMO-QPSO: A multi-objective quantum-behaved particle swarm optimization algorithm based on decomposition with diversity control"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/dmo-qpso-a-multi-objective-quantum-behaved-particle-swarm-optimiz", "abstract": [], "Keywords": ["Particle Swarm Optimization Algorithm", "Particle Swarm Optimization", "Particle swarm optimization (PSO)", "Decomposition", "Decompose", "Multi-objective Evolutionary Algorithm", "Performance", "Premature Convergence"], "authors_name": ["You, Q.", "Sun, J.", "Pan, F.", "Palade, V.", "Ahmad, B.", "Economic Evaluation of Mental Health Effects of Flooding Using Bayesian Networks", "Sedighi, T.", "Varga, L.", "Hosseinian-Far, A.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["16 Aug 2021"]},
{"title": ["Efficient activity recognition using lightweight CNN and DS-GRU network for surveillance applications"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/efficient-activity-recognition-using-lightweight-cnn-and-ds-gru-n", "abstract": [], "Keywords": ["Convolutional neural networks", "Data streams", "Deep learning", "Computational complexity", "Classifiers", "Experiments"], "authors_name": ["Ullah, A.", "Muhammad, K.", "Ding, W.", "Palade, V.", "Haq, I. U.", "Baik, S. W.", "Efimov-DNA Phase diagram: three stranded DNA on a cubic lattice", "Bhattacharjee, S. M.", "Foster, D. P.", "EnSuRe: Energy & Accuracy Aware Fault-tolerant Scheduling on Real-time Heterogeneous Systems", "Saha, S.", "Adetomi, A.", "Zhai, X.", "Kasap, S.", "Ehsan, S.", "Arslan, T.", "McDonald-Maier, K.", "Evaluation of a Switched Combining Based Distributed Antenna System (DAS) for Pedestrian-to-Vehicle Communications", "Yoo, S.", "Cotton, S.", "Zhang, L.", "Doone, M.", "Song, J. S.", "Rajbhandari, S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["May 2021"]},
{"title": ["Finding the Uncomfortable Solution: Responsible Innovation in Humanitarian Energy"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/finding-the-uncomfortable-solution-responsible-innovation-in-huma", "abstract": ["In response to the increasing number of displaced people, the humanitarian sector is exploring innovation as a framework to improve the delivery of the Sustainable Development Goals (SDGs). Traditionally, the focus on camp settings and short term solutions have resulted in a humanitarian response that is slow to adapt to the rapidity of technological innovation (Betts and Bloom, 2014). For example, 87.8% of African’s in Sub-Saharan Africa have a mobile phone (World Bank, 2019), yet 80% of displaced people living in camps in this same region still cook over open fires which are linked to long term health and environmental effects (Grafham and Lahn, 2018).", "As a result of the lessons learned from the Humanitarian Engineering and Energy for Displacement (HEED) project around the different perceptions of innovation between key energy stakeholders, this paper looks to engage with questions around ensuring innovation in the humanitarian sector, and more specifically humanitarian energy, is responsible. How can we define responsible? Is responsible innovation a theoretical nicety or can it ensure a just energy transition as outlined by the SDGs? What does responsible innovation look like in reality? Building to our underlying research question: what is the state-of-the-art in responsible innovation for humanitarian energy and how is it implemented at project level?"], "Keywords": ["innovation", "energy", "Sustainable Development Goal", "camp", "World Bank", "mobile phone", "project", "environmental effect"], "authors_name": ["Robinson, B.", "Halford, A.", "Gaura, E."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/elena-gaura", "https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["5 Oct 2021"]},
{"title": ["Guest Editorial: Special Issue on Deep Representation and Transfer Learning for Smart and Connected Health"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/guest-editorial-special-issue-on-deep-representation-and-transfer", "abstract": ["Deep neural networks (NNs) have been proved to be efficient learning systems for supervised and unsupervised tasks. However, learning complex data representations using deep NNs can be difficult due to problems such as lack of data, exploding or vanishing gradients, high computational cost, or incorrect parameter initialization, among others. Deep representation and transfer learning (RTL) can facilitate the learning of data representations by taking advantage of transferable features learned by an NN model in a source domain, and adapting the model to a new domain."], "Keywords": ["Transfer learning", "Deep neural networks", "Health", "Learning systems", "Neural networks", "Costs"], "authors_name": ["Palade, V.", "Wermter, S.", "Ruiz-Garcia, A.", "De Padua Braga, A.", "Took, C. C."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["4 Feb 2021"]},
{"title": ["Generative adversarial network-based scheme for diagnosing faults in cyber-physical power systems"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/generative-adversarial-network-based-scheme-for-diagnosing-faults", "abstract": [], "Keywords": ["Motor Vehicles", "Sampling", "modules", "Computer Communication Networks", "Voltage", "Resistance", "Voltage measurement", "Noise"], "authors_name": ["Hassani, H.", "Razavi-Far, R.", "Saif, M.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["30 Jul 2021"]},
{"title": ["Improving skin cancer classification using heavy-tailed student t-distribution in generative adversarial networks (Ted-gan)"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/improving-skin-cancer-classification-using-heavy-tailed-student-t", "abstract": [], "Keywords": ["Classifier", "Skin Neoplasms", "Noise", "Students", "Deep Learning", "Skin", "Diagnostic Imaging", "Normal Distribution"], "authors_name": ["Ahmad, B.", "Jun, S.", "Palade, V.", "You, Q.", "Mao, L.", "Zhongjie, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["19 Nov 2021"]},
{"title": ["Generation of Pedestrian Crossing Scenarios Using Ped-Cross Generative Adversarial Network"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/generation-of-pedestrian-crossing-scenarios-using-ped-cross-gener", "abstract": ["The safety of vulnerable road users is of paramount importance as transport moves towards fully automated driving. The richness of real-world data required for testing autonomous vehicles is limited and furthermore, available data do not present a fair representation of different scenarios and rare events. Before deploying autonomous vehicles publicly, their abilities must reach a safety threshold, not least with regards to vulnerable road users, such as pedestrians. In this paper, we present a novel Generative Adversarial Networks named the Ped-Cross GAN. Ped-Cross GAN is able to generate crossing sequences of pedestrians in the form of human pose sequences. The Ped-Cross GAN is trained with the Pedestrian Scenario dataset. The novel Pedestrian Scenario dataset, derived from existing datasets, enables training on richer pedestrian scenarios. We demonstrate an example of its use through training and testing the Ped-Cross GAN. The results show that the Ped-Cross GAN is able to generate new crossing scenarios that are of the same distribution from those contained in the Pedestrian Scenario dataset. Having a method with these capabilities is important for the future of transport, as it will allow for the adequate testing of Connected and Autonomous Vehicles on how they correctly perceive the intention of pedestrians crossing the street, ultimately leading to fewer pedestrian casualties on our roads. "], "Keywords": ["Crosswalks", "roads", "Autonomous vehicles", "vehicles", "Safety", "education", "safety", "casualties"], "authors_name": ["Spooner, J. P.", "Palade, V.", "Cheah, M.", "Kanarachos, S.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alireza-daneshkhah", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["6 Jan 2021"]},
{"title": ["Investigating the effects of two fragrances on comfort in the automotive context"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/investigating-the-effects-of-two-fragrances-on-comfort-in-the-aut", "abstract": ["What is this the impact of olfactory and visual factors on overall comfort? Can these factors have an effect on the perception of thermal comfort? These questions are particularly interesting in the context of a vehicle car cabin, since it leads to the possibility of visual or olfactory cues being used to maintain passenger thermal comfort at a lower energy cost. In this work, human subject trials (n=47) were performed in a temperature-controlled environ-ment varying air temperature, ambient light (none, yellow, blue) and scent (neutral, peppermint, orange & cinna-mon). Multiple linear regression shows olfactory factors to have a larger effect on overall comfort perception than visual factors. Either scent improved thermal perception in a slightly cold environment, while only peppermint im-proved thermal perception in a slightly warm environment. These results suggest that the use of visual and olfac-tory factors have the potential to increase car cabin comfort and / or improve the energy efficiency of the car cli-mate system."], "Keywords": ["Fragrances", "Thermal comfort", "Linear regression", "Hot Temperature", "Temperature", "Energy efficiency", "Air", "Costs"], "authors_name": ["Gentner, A.", "Gradinati, G.", "Favart, C.", "Gyamfi, K. S.", "Brusey, J.", "IOS Press"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-brusey"], "publication_date": ["8 Jan 2021"]},
{"title": ["Improving Algebraic Tools to Study Bifurcation Sequences of Population Models"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/improving-algebraic-tools-to-study-bifurcation-sequences-of-popul", "abstract": ["Since being introduced by Collins in the 1970s Cylindrical Algebraic Decomposition has found many applications. We focus on its use to decomposition the parameter space of a parametric system of polynomial equations, and possibly some polynomial inequality constraints, with respect to the number of real solutions that the system attains.  Previous studies simplify the CAD computation by first computing the discriminant variety of the system, which usually involves Gr¨obner Basis computation. However, on some even very small applied examples this itself can become expensive. Thus we consider development of new algorithms to reduce the complexity of this approach, by adopting numerical ideas and some recent technical developments in CAD theory. In this extended abstract we outline our recent progress as evaluated on an example from population dynamics with the Allee effect."], "Keywords": ["Computer aided design", "Polynomials", "Population dynamics", "Decomposition"], "authors_name": ["Sadeghimanesh, A.", "England, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["14 Sep 2021"]},
{"title": ["IoT-Enabled Light Intensity-Controlled Seamless Highway Lighting System"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/iot-enabled-light-intensity-controlled-seamless-highway-lighting-", "abstract": [], "Keywords": ["Internet of things", "Lighting", "Network components", "Costs", "Cost reduction", "Operating costs", "Network architecture", "Outages"], "authors_name": ["Rahman, M. A.", "Asyhari, A. T.", "Obaidat, M. S.", "Kurniawan, I. F.", "Mukta, M. Y.", "Vijayakumar, P."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/ibnu-febry-kurniawan"], "publication_date": ["Mar 2021"]},
{"title": ["Learning to localise automated vehicles in challenging environments using inertial navigation systems (INS)"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/learning-to-localise-automated-vehicles-in-challenging-environmen", "abstract": [], "Keywords": ["inertial navigation", "Inertial navigation systems", "learning", "vehicles", "satellite navigation systems", "Navigation", "Error", "Neural networks"], "authors_name": ["Onyekpe, U.", "Palade, V.", "Kanarachos, S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["30 Jan 2021"]},
{"title": ["IO-VNBD: Inertial and Odometry benchmark dataset for ground vehicle positioning"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/io-vnbd-inertial-and-odometry-benchmark-dataset-for-ground-vehicl-2", "abstract": [], "Keywords": ["Ground vehicles", "Navigation", "Sensors", "Global positioning system", "Motion sensors", "Traffic congestion", "Autonomous vehicles", "Benchmarking"], "authors_name": ["Onyekpe, U.", "Palade, V.", "Kanarachos, S.", "Szkolnik, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Apr 2021"]},
{"title": ["Learning Uncertainties in Wheel Odometry for Vehicular Localisation in GNSS Deprived Environments"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/learning-uncertainties-in-wheel-odometry-for-vehicular-localisati", "abstract": [], "Keywords": ["Inertial navigation systems", "Wheels", "Satellites", "Navigation", "Uncertainty", "Tires", "Accelerometers", "Signal systems"], "authors_name": ["Onyekpe, U. A.", "Palade, V.", "Kanarachos, S.", "Christopoulos, S.", "Measuring local sensitivity in Bayesian inference using a new class of metrics", "Sedighi, T.", "Hosseinian-Far, A.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/stavros-christopoulos", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Feb 2021"]},
{"title": ["Mobile computing and communications-driven fog-assisted disaster evacuation techniques for context-aware guidance support: A survey"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/mobile-computing-and-communications-driven-fog-assisted-disaster-", "abstract": ["The importance of an optimal solution for disaster evacuation has recently raised attention from researchers across multiple disciplines. This is not only a serious, but also a challenging task due to the complexities of the evacuees’ behaviors, route planning, and demanding coordination services. Although existing studies have addressed these challenges to some extent, mass evacuation in natural disasters tends to be difficult to predict and manage due to the limitation of the underlying models to capture realistic situations. It is therefore desirable to have on-demand mechanisms of locally-driven computing and data exchange services in order to enable near real-time capture of the disaster area during the evacuation. For this purpose, this paper comprehensively surveys recent advances in information and communication technology-enabled disaster evacuations, with the focus on fog computation and communication services to support a massive evacuation process. A numerous variety of tools and techniques are encapsulated within a coordinated on-demand strategy of an evacuation platform, which is aimed to provide a situational awareness and response. Herein fog services appear to be one of the viable options for responsive mass evacuation because they enable low latency data processing and dissemination. They can additionally provide data analytics support for autonomous learning for both the short-term guidance supports and long-term usages. This work extends the existing data-oriented framework by outlining comprehensive functionalities and providing seamless integration. We review the principles, challenges, and future direction of the state-of-the-art strategies proposed to sit within each functionality. Taken together, this survey highlights the importance of adaptive coordination and reconfiguration within the fog services to facilitate responsive mass evacuations as well as open up new research challenges associated with analytics-embedding network and computation, which is critical for any disaster recovery activities."], "Keywords": ["Disasters", "Mobile computing", "Fog", "Communication", "Data Analytics", "Electronic data interchange", "Information technology", "Recovery"], "authors_name": ["Kurniawan, I. F.", "Asyhari, A. T.", "He, F.", "Liu, Y.", "Modelling the effect of market forces on the impact of introducing human immunodeficiency virus pre‐exposure prophylaxis among female sex workers", "Quaife, M.", "Terris‐Prestholt, F.", "Mukandavire, Z.", "Vickerman, P."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/ibnu-febry-kurniawan", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["1 Nov 2021"]},
{"title": ["Optimising feedstock flowrate to improve the performance of an existing anaerobic digestion system."], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/optimising-feedstock-flowrate-to-improve-the-performance-of-an-ex", "abstract": ["This paper presents an approach to model and optimise the feedstock flowrate of an anaerobic digestion (AD) cooking system by simultaneously minimising the volume of flared biogas, the unmet cooking demand and the energy cost. As research has typically focused on optimising the digester and its associated parameters to maximise the biogas yield; this research examines how different objectives can influence how one might want to control the system. The system is initially modelled and validated with measured data and an optimisation algorithm is then applied to control the feedstock flow rate. The results show that the performance of first order AD models, in predicting the biogas yield, only differs from measured data by 9% and that by controlling the feeding rate, the amount of flared biogas and unmet cooking demand can be reduced by 100% and approximately 87%, respectively when they are the only objective functions considered. If the energy cost is also added an objective function, then more precise control of feeding rate is needed to ensure that all three conflicting objectives are equally minimised. This result highlights the importance of using the correct feeding rate in the system and considering the overall system during optimisation as producing more biogas might not result in the most cost-effectivesystem."], "Keywords": ["anaerobic digestion", "biogas", "cost", "rate", "demand", "digester", "energy", "parameter"], "authors_name": ["Ashraf, R. J.", "Nixon, J. D.", "Brusey, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/jonathan-nixon", "https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/rjaa-jawad-ashraf"], "publication_date": ["24 Jun 2021"]},
{"title": ["MSLDOCK: Multi-Swarm Optimization for Flexible Ligand Docking and Virtual Screening"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/msldock-multi-swarm-optimization-for-flexible-ligand-docking-and-", "abstract": [], "Keywords": ["Ligands", "Screening", "efficiency", "Ligand", "Environment", "performance", "Particle swarm optimization (PSO)"], "authors_name": ["Li, C.", "Sun, J.", "Palade, V."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["22 Mar 2021"]},
{"title": ["Nonlinear System Identification of Neural Systems from Neurophysiological Signals"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/nonlinear-system-identification-of-neural-systems-from-neurophysi-2", "abstract": [], "Keywords": ["Neural Pathways", "Nervous System Diseases", "Causality", "Nervous System", "Biomarkers", "Neurons"], "authors_name": ["He, F.", "Yang, Y.", "Novel lockstep-based fault mitigation approach for SoCs with roll-back and roll-forward recovery", "Kasap, S.", "Weber Wachter, E.", "Zhai, X.", "Ehsan, S.", "McDonald-Maier, K."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["15 Mar 2021"]},
{"title": ["Nonlinear Estimation of Sensor Faults With Unknown Dynamics for a Fixed Wing Unmanned Aerial Vehicle"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/nonlinear-estimation-of-sensor-faults-with-unknown-dynamics-for-a", "abstract": ["In this paper, the estimation of additive inertial navigation sensor faults with unknown dynamics is considered with application to the longitudinal navigation and control of a fixed wing unmanned aerial vehicle. The faulty measurement is on the pitch angle.", "A jump Markov regularized particle filter is proposed for fault and state estimation of the nonlinear aircraft dynamics, with a Markovian jump strategy to manage the probabilistic transitions between the fault free and faulty modes. The jump strategy uses a small number of sentinel particles to continue testing the alternate hypothesis under both fault free and faulty modes. The proposed filter is shown to outperform the regularized particle filter for this application in terms of fault estimation accuracy and convergence time for scenarios involving both abrupt and incipient faults, without prior knowledge of the fault models. The state estimation is also more accurate and robust to faults using the proposed approach. The root-mean-square error for the altitude is reduced by 77% using the jump Markov regularized particle filter under a pitch sensor fault amplitude of up to 10 degrees. Performance enhancement compared to the regularized particle filter was found to be more pronounced when fault amplitudes increase."], "Keywords": ["Unmanned Aerial Vehicle", "Nonlinear Estimation", "Fixed wings", "Sensor", "Fault", "State estimation", "Unmanned aerial vehicles (UAV)", "Navigation"], "authors_name": ["Iglésis, E.", "Horri, N.", "Dahia, K.", "Brusey, J.", "Piet-Lahanier, H."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/nadjim-horri"], "publication_date": ["19 Jul 2021"]},
{"title": ["Multi-Phase Locking Value: A Generalized Method for Determining Instantaneous Multi-frequency Phase Coupling"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/multi-phase-locking-value-a-generalized-method-for-determining-in", "abstract": [" Many physical, biological and neural systems behave as coupled oscillators, with characteristic phase coupling across different frequencies. Methods such as $n:m$ phase locking value and bi-phase locking value have previously been proposed to quantify phase coupling between two resonant frequencies (e.g. f, 2f/3) and across three frequencies (e.g. f_1, f_2, f_1+f_2), respectively. However, the existing phase coupling metrics have their limitations and limited applications. They cannot be used to detect or quantify phase coupling across multiple frequencies (e.g. f_1, f_2, f_3, f_4, f_1+f_2+f_3-f_4), or coupling that involves non-integer multiples of the frequencies (e.g. f_1, f_2, 2f_1/3+f_2/3). To address the gap, this paper proposes a generalized approach, named multi-phase locking value (M-PLV), for the quantification of various types of instantaneous multi-frequency phase coupling. Different from most instantaneous phase coupling metrics that measure the simultaneous phase coupling, the proposed M-PLV method also allows the detection of delayed phase coupling and the associated time lag between coupled oscillators. The M-PLV has been tested on cases where synthetic coupled signals are generated using white Gaussian signals, and a system comprised of multiple coupled Rossler oscillators. Results indicate that the M-PLV can provide a reliable estimation of the time window and frequency combination where the phase coupling is significant, as well as a precise determination of time lag in the case of delayed coupling. This method has the potential to become a powerful new tool for exploring phase coupling in complex nonlinear dynamic systems. "], "Keywords": ["Biological systems", "Natural frequencies", "Dynamical systems", "Biological systems", "Natural frequencies", "Dynamical systems", "Nonlinear Dynamics", "Research Subjects"], "authors_name": ["Yang, Y.", "Vasudeva, B.", "Refai, H. H.", "He, F.", "arXiv"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["20 Feb 2021"]},
{"title": ["Pedestrian and Vehicle Detection in Autonomous Vehicle Perception Systems—A Review"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/pedestrian-and-vehicle-detection-in-autonomous-vehicle-perception", "abstract": ["Autonomous Vehicles (AVs) have the potential to solve many traffic problems, such as accidents, congestion and pollution. However, there are still challenges to overcome, for instance, AVs need to accurately perceive their environment to safely navigate in busy urban scenarios. The aim of this paper is to review recent articles on computer vision techniques that can be used to build an AV perception system. AV perception systems need to accurately detect non-static objects and predict their behaviour, as well as to detect static objects and recognise the information they are providing. This paper, in particular, focuses on the computer vision techniques used to detect pedestrians and vehicles. There have been many papers and reviews on pedestrians and vehicles detection so far. However, most of the past papers only reviewed pedestrian or vehicle detection separately. This review aims to present an overview of the AV systems in general, and then review and investigate several detection computer vision techniques for pedestrians and vehicles. The review concludes that both traditional and Deep Learning (DL) techniques have been used for pedestrian and vehicle detection; however, DL techniques have shown the best results. Although good detection results have been achieved for pedestrians and vehicles, the current algorithms still struggle to detect small, occluded, and truncated objects. In addition, there is limited research on how to improve detection performance in difficult light and weather conditions. Most of the algorithms have been tested on well-recognised datasets such as Caltech and KITTI; however, these datasets have their own limitations. Therefore, this paper recommends that future works should be implemented on more new challenging datasets, such as PIE and BDD100K."], "Keywords": ["Pedestrians", "Accident", "Autonomous vehicles", "vehicles", "Environment", "Deep Learning", "Computer vision", "Datasets"], "authors_name": ["Galvao, L. G.", "Abbod, M.", "Kalganova, T.", "Palade, V.", "Huda, M. N.", "Predicting mortality, duration of treatment, pulmonary embolism and required ceiling of ventilatory support for COVID-19 inpatients: A Machine-Learning Approach", "Vepa, A.", "Saleem, A.", "Rakhshanbabanari, K.", "Chatrabgoun, O.", "Sedighi, T.", "Daneshkhah, A.", "Predicting the technical reusability of load-bearing building components: A probabilistic approach towards developing a Circular Economy framework", "Rakhshanbabanari, K.", "Morel, J-C.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["Nov 2021"]},
{"title": ["Simultaneous Actuator and Sensor Faults Estimation for Aircraft Using a Jump-Markov Regularized Particle Filter"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/simultaneous-actuator-and-sensor-faults-estimation-for-aircraft-u", "abstract": [], "Keywords": ["Particle Filter", "Sensor", "Jump", "Fault", "Aircraft", "Actuators", "Sensors", "Electric fault currents"], "authors_name": ["Iglésis, E.", "Horri, N.", "Brusey, J.", "Dahia, K.", "Piet-Lahanier, H.", "SSF: Smart city Semantics Framework for reusability of semantic data", "Lee, J.", "Jeong, S.", "Yoo, S.", "Song, J. S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/nadjim-horri"], "publication_date": ["7 Jun 2021"]},
{"title": ["Unpacking Gender and Sexuality in Contemporary Mormonism"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/unpacking-gender-and-sexuality-in-contemporary-mormonism", "abstract": [], "Keywords": [], "authors_name": ["Halford, A.", "Unsupervised Doppler Radar Based Activity Recognition for e-Healthcare", "Karayaneva, Y.", "Sharifzadeh, S.", "Li, W.", "Jing, Y.", "Tan, B.", "Using Machine Learning Algorithms to Develop a Clinical Decision-Making Tool for COVID-19 Inpatients", "Veoa, A.", "Saleem, A.", "Rakhshan, K.", "Daneshkhah, A.", "Sedighi, T.", "Shohaimi, S.", "Omar, A.", "Salari, N.", "Chatrabgoun, O.", "Dharmaraj, D.", "Sami, J.", "Parekh, S.", "Ibrahim, M.", "Raza, M.", "Kapila, P.", "Chakrabarti, P."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["1 Oct 2021"]},
{"title": ["The DEWCAD project: pushing back the doubly exponential wall of cylindrical algebraic decomposition"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-dewcad-project-pushing-back-the-doubly-exponential-wall-of-cy", "abstract": ["This abstract seeks to introduce the ISSAC community to the DEWCAD project, which is based at Coventry University and the University of Bath, in the United Kingdom.  The project seeks to push back the Doubly Exponential Wall of Cylindrical Algebraic Decomposition, through the integration of SAT/SMT technology, the extension of Lazard projection theory, and the development of new algorithms based on CAD technology but without producing CADs themselves.  The project also seeks to develop applications of CAD and will focus on applications in the domains of economics and bio-network analysis."], "Keywords": ["Network Analysis", "Decompose", "Community", "Economics", "Projection"], "authors_name": ["Bradford, R.", "Davenport, J. H.", "England, M.", "Sadeghimanesh, A.", "Uncu, A.", "The epidemiological landscape of anemia in women of reproductive age in sub-Saharan Africa", "Correa-Agudelo, E.", "Kim, H. Y.", "Musuka, G. N.", "Mukandavire, Z.", "Miller, F. D. W.", "Tanser, F.", "Cuadros, D. F."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england", "https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["Sep 2021"]},
{"title": ["The challenges of community-based solar energy interventions: Lessons from two Rwandan Refugee Camps"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-challenges-of-community-based-solar-energy-interventions-less", "abstract": ["The paper presents evidence from the performance assessment of two solar energy interventions. Specifically, an evidence base was built around two community co-conceived standalone photovoltaic-battery systems, which were deployed in two refugee camps in Rwanda. We found that for both installations (a micro-grid and a community hall electrification system) energy consumption levels were low, showing that sizeable energy consumption gaps can still develop when co-conceived interventions are deployed. The consumption gap led to low performance ratios (33% and 25% respectively for the micro-grid and community hall system). To guide further work and improve the sustainability of community interventions, we draw a number of design principles for future energy interventions in similar contexts. To deliver sustainable energy transitions for refugees, there needs to be a move towards co-creating community interventions that promote self-governance to position communities as users, maintainers and suppliers of energy services, throughout an intervention's lifetime."], "Keywords": ["refugee", "solar energy", "camp", "Solar energy", "energy consumption", "Energy utilization", "electrification", "performance assessment", "refugee", "camp", "energy", "electrification", "alternative energy"], "authors_name": ["Nixon, J.", "Bhargava, K.", "Halford, A.", "Gaura, E."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/jonathan-nixon", "https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/elena-gaura"], "publication_date": ["Dec 2021"]},
{"title": ["The Salience of Islam to Muslim Heritage Children’s Experiences of Identity, Family, and Well-Being in Foster Care"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-salience-of-islam-to-muslim-heritage-childrens-experiences-of", "abstract": ["All children need permanent and secure homes in which they can explore their identities and evolve as human beings, citizens, and family members, and within which can they have a sense of security, continuity, stability, and belonging. There are approximately 4500 children of Muslim heritage in the care system in England and Wales, and this number is increasing. Using case studies that emerged from qualitative fieldwork, this article examines the role and impact of religion on children’s journeys through the care system, particularly in foster care. This article concludes that irrespective of the level of engagement Muslim heritage children in the care system have with their religious heritage, Islam has an enduring impact on how they perceive their identities. As a result, there is a pressing need for social workers and foster carers who care for these children to gain greater insights into Islam and Muslim culture. Such insights and understandings will help children settle faster and form stronger bonds of attachment with their foster carers, and in the long term, this will enhance life outcomes for these children."], "Keywords": ["Islam", "Well-being", "Heritage", "Muslims", "Carers", "Social Workers", "Religious Heritage", "Wales", "Islam", "Politics", "Religion", "Child Care", "Muslim"], "authors_name": ["Cheruvallil-Contractor, S.", "Halford, A.", "Phiri, M. B.", "Topic modelling in precision medicine with its applications in personalized diabetes management", "Ni Ki, C.", "Hosseinian-Far, A.", "Daneshkhah, A.", "Salari, N.", "Towards algorithm-free physical equilibrium model of computing", "Mousavi, S.", "Understanding HIV and associated risk factors among religious groups in Zimbabwe", "Mapingure, M.", "Mukandavire, Z.", "Chingombe, I.", "Cuadros, D.", "Mutenherwa, F.", "Mugurungi, O.", "Musuka, G."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor"], "publication_date": ["25 May 2021"]},
{"title": ["WhONet: Wheel Odometry neural Network for vehicular localisation in GNSS-deprived environments"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/whonet-wheel-odometry-neural-network-for-vehicular-localisation-i", "abstract": [], "Keywords": ["Wheels", "Satellites", "Navigation", "Neural networks", "Tires", "Deep learning", "Uncertainty", "Signal systems"], "authors_name": ["Onyekpe, U.", "Palade, V.", "Herath, A.", "Kanarachos, S.", "Fitzpatrick, M. E."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/anuradha-herath", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade", "https://pureportal.coventry.ac.uk/en/persons/michael-fitzpatrick"], "publication_date": ["Oct 2021"]},
{"title": ["Scenario Optimisation and Sensitivity Analysis for Safe Automated Driving Using Gaussian Processes"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/scenario-optimisation-and-sensitivity-analysis-for-safe-automated", "abstract": ["Assuring the safety of automated vehicles is essential for their timely introduction and acceptance by policymakers and the public. To assess their safe design and robust decision making in response to all possible scenarios, new methods that use a scenario-based testing approach are needed, as testing on public roads in normal traffic would require driving millions of kilometres. We make use of the scenario-based testing approach and propose a method to model simulated scenarios using Gaussian Process based models to predict untested scenario outcomes. This enables us to efficiently determine the performance boundary, where the safe and unsafe scenarios can be evidently distinguished from each other. We present an iterative method that optimises the parameter space of a logical scenario towards the most critical scenarios on this performance boundary. Additionally, we conduct a novel probabilistic sensitivity analysis by efficiently computing several variance-based sensitivity indices using the Gaussian Process models and evaluate the relative importance of the scenario input parameters on the scenario outcome. We critically evaluate and investigate the usefulness of the proposed Gaussian Process based approach as a very efficient surrogate model, which can model the logical scenarios effectively in the presence of uncertainty. The proposed approach is applied on an exemplary logical scenario and shows viability in finding concrete critical scenarios. The reported results, derived from the proposed approach, could pave the way to more efficient testing of automated vehicles and instruct further physical tests on the determined critical scenarios."], "Keywords": ["sensitivity analysis", "Sensitivity analysis", "optimization", "Testing", "vehicles", "Safety", "decision making", "viability"], "authors_name": ["Batsch, F.", "Daneshkhah, A.", "Palade, V.", "Cheah, M.", "Security Improvement for Energy Harvesting based Overlay Cognitive Networks with Jamming-Assisted Full-Duplex Destinations", "Ho-Van, K.", "Sofotasios, P.", "Muhaidat, S.", "Cotton, S.", "Yoo, S.", "Brychkov, Y. A.", "Dobre, O. A.", "Valkama, M."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alireza-daneshkhah", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["15 Jan 2021"]},
{"title": ["Working Towards Modern, Affordable & Sustainable Energy Systems in the Context of Displacement: Recommendations for Researchers and Practitioners"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/working-towards-modern-affordable-amp-sustainable-energy-systems-", "abstract": ["Working towards modern, affordable & sustainable energy systems in the context of displacement: Recommendations for researchers and practitioners is a working paper drawn from presentations and discussions that emerged during the ‘Agency of Change: Energy in the Displaced Context’ digital Conference held on Wednesday 4th November 2020. The conference was organised by the Centre of Data Science, Coventry University on behalf of the GCRF EPSRC Humanitarian Engineering and Energy for Displacement (HEED) project. This report summarises the discussions that took place between practitioners, academics, policymakers and the HEED team during the HEED working conference on Wednesday 4 November 2020. Drawing upon a range of expertise in the field of social science, humanitarian and renewables engineering and computer science, conference participants sought to identify potential solutions, innovative responses and best practices to increase access to safe, sustainable and affordable energy in the context of displacement."], "Keywords": ["alternative energy", "recommendation", "engineering", "energy", "science", "social science", "project"], "authors_name": ["Halford, A.", "Coventry University"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["18 Jan 2021"]},
{"title": ["‘Come, Follow Me’, The Sacralising of the Home, and The Guardian of the Family: How Do European Women Negotiate the Domestic Space in the Church of Jesus Christ of Latter-Day Saints?"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/come-follow-me-the-sacralising-of-the-home-and-the-guardian-of-th", "abstract": [], "Keywords": ["Latter-day Saints", "Domestic Space", "Guardian", "Church Teaching", "Jesus", "Gender Roles", "Religious Instruction", "Lived Religion"], "authors_name": ["Halford, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["12 May 2021"]},
{"title": ["Proving UNSAT in SMT: The Case of Quantifier Free Non-Linear Real Arithmetic"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/proving-unsat-in-smt-the-case-of-quantifier-free-non-linear-real-", "abstract": ["We discuss the topic of unsatisfiability proofs in SMT, particularly with reference to quantifier free non-linear real arithmetic. We outline how the methods here do not admit trivial proofs and how past formalisation attempts are not sufficient. We note that the new breed of local search based algorithms for this domain may offer an easier path forward."], "Keywords": ["Quantifiers", "Local Search", "Formalization", "Trivial", "Sufficient", "Path"], "authors_name": ["Ábrahám, E.", "Davenport, J. H.", "England, M.", "Kremer, G.", "Real-time registration of 3D echo to X-ray fluoroscopy based on cascading classifiers and image registration", "Ma, Y.", "Houston, R. J.", "Fazili, A.", "Rhode, K. S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["16 Jul 2021"]},
{"title": ["A Leap from Randomized to Quantum Clustering with Support Vector Machine - A Computation Complexity Analysis"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-leap-from-randomized-to-quantum-clustering-with-support-vector-", "abstract": ["Supervised machine learning deals with developing complex non-linear models, which can be used later to predict the output for a known input. Clustering is usually treated as an unsupervised machine learning task, but we can formulate a solution to a clustering problem by using a supervised classification algorithm [1]. However, these classification algorithms are highly computationally intensive in nature, so the overall complexity in designing a clustering solution is often very costly from an implementation point of view. The more data we use, the more computational power is required too. Recent advancements in quantum computing show promising advantages in dealing with this kind of computational issues we face while training a complex machine-learning algorithm. In this paper, we do a theoretical investigation on the runtime complexity of algorithms, from classical to randomized, and then to quantum frameworks, when designing a clustering algorithm. The analysis shows significant computational advantages with a quantum framework as compared to the classical and randomized versions of the implementation."], "Keywords": ["Support vector machines", "Machine learning", "Clustering algorithms", "Learning algorithms"], "authors_name": ["Bishwas, A. K.", "Mani, A.", "Palade, V.", "A low cost and highly accurate technique for big data spatial-temporal interpolation", "Esmaeilbeigi, M.", "Chatrabgoun, O.", "Hosseinian-Far, A.", "Montasari, R.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["3 Aug 2020"]},
{"title": ["A scalable hybrid MAC strategy for traffic-differentiated IoT-enabled intra-vehicular networks"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-scalable-hybrid-mac-strategy-for-traffic-differentiated-iot-ena", "abstract": ["The increasing popularity of Internet of Things-enabled Intra-Vehicular Wireless Sensor Networks (IoT-IVWSNs) relying on IEEE 802.15.4 standard has generated a massive amount of wireless data traffic and put a great pressure in the network functionalities. Along this trend, the existing medium-access control (MAC) protocol struggles to keep up with the unprecedented demand of vehicle monitoring sensors simultaneously emitting data, which can lead to packet collisions, severe network congestion and lost of time-critical data, due to the inflexible characteristics of the protocol. In order to mitigate these issues, this work proposes an enhanced MAC scheme that is scalable to account for diverse sensor-traffic quality of services. The hybrid scheme aims to effectively combine two procedures, namely history- and priority-based MAC, to allocate appropriate network resources for smooth transmission flow from multiple sensors. History-based MAC exploits historical contention data to optimize a near-future contention window that aims to minimize packet collision and expedite the average data delivery. Priority-based MAC assigns priority based on the time-criticality of the sensing data, which is subsequently being used to schedules network resources. Numerical results show the desirable performance of the hybrid scheme for IoT-IVWSNs in comparison to the existing MAC and sole history-based or priority-based strategies in the context of packet delivery ratio and transmission delay."], "Keywords": ["Medium access control", "Internet of things", "Wireless sensor networks", "Sensors", "Network protocols", "IEEE Standards", "Telecommunication traffic", "Quality of service"], "authors_name": ["Rahman, M. A.", "Asyhari, A. T.", "Kurniawan, I. F.", "Ali, M. J.", "Rahman, M. M.", "Karim, M.", "Behavioural Analytics: A Preventative Means for the Future of Policing", "Daneshkhah, A.", "Jahankhani, H.", "Forouzan, H.", "Montasari, R.", "Hosseinian-Far, A.", "Springer", "Components reuse in the building sector – A systematic review", "Rakhshanbabanari, K.", "Morel, J-C.", "Alaka, H.", "Charef, R.", "Constructing gene regulatory networks from microarray data using non-Gaussian pair-copula Bayesian networks", "Chatrabgoun, O.", "Hosseinian-Far, A.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/ibnu-febry-kurniawan"], "publication_date": ["1 May 2020"]},
{"title": ["Generation of pedestrian pose structures using generative adversarial networks"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/generation-of-pedestrian-pose-structures-using-generative-adversa", "abstract": [], "Keywords": ["Pedestrian", "Autonomous vehicles", "Network architecture", "Classifiers", "Testing", "Autonomous Vehicles", "Rare Events", "Scenarios"], "authors_name": ["Spooner, J.", "Cheah, M.", "Palade, V.", "Kanarachos, S.", "Daneshkhah, A.", "Institute of Electrical and Electronics Engineers Inc.", "Geometrical Frustration in Interacting Self-Avoiding Walk Models of Polymers in Dilute Solution", "Foster, D.", "World Scientific", "Individual and community-level benefits of PrEP in western Kenya and South Africa: Implications for population prioritization of PrEP provision", "Mudimu, E.", "Peebles, K.", "Mukandavire, Z.", "Nightingale, E.", "Sharma, M.", "Medley, G. F.", "Klein, D. J.", "Kripke, K.", "Bershteyn, A.", "Indoor Visible Light Communication: A Tutorial and Survey", "Allycan Mapunda, G.", "Ramogomana, R.", "Marata, L.", "Basutli, B.", "Khan, A. S.", "Monamati Chuma, J."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alireza-daneshkhah", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["17 Feb 2020"]},
{"title": ["Energy Optimization on Joint Task Computation Using Genetic Algorithm"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/energy-optimization-on-joint-task-computation-using-genetic-algor", "abstract": ["Joint computation is a form of collaborative job execution running at separate physical units, which are previously grouped by their unique functionalities. While existing studies have mainly utilized joint computation with direct coordination between nodes in different segments, it is worth considering another scenario where an additional node within a layer relays data to another layer. As a consequence, the node can serve as an aggregation point for data capture units prior to transmission to the sink node. However, this new arrangement produces additional transmission paths and can thus cause additional energy spending. This pilot study investigates the joint computation problem aiming at optimizing energy consumption. Relevant components, such as computation and communication, are taken into account and modeled into formal representation. A genetic algorithm-based solution is then used as a tool to optimize parameter setup. According to the experiment results, the metaheuristic algorithm has potential to achieve the optimal system configuration, emphasizing the data length that affects the final energy spending on communications. However, the algorithm cannot always guarantee the optimality as it relies on the random variable used in the process."], "Keywords": ["Genetic algorithms", "Optimal systems", "Random variables", "Communication", "Agglomeration", "Data acquisition", "Energy utilization", "Experiments"], "authors_name": ["Kurniawan, I. F.", "Asyhari, T.", "He, F.", "Evaluating assumptions of scales for subjective assessment of thermal environments – Do laypersons perceive them the way, we researchers believe?", " & 73 others", "De Vecchi, R.", "Dhaka, S.", "Domínguez-Amarillo, S.", "Dudkiewicz, E.", "Edappilly, L. P.", "Fernández-Agüera, J.", "Folkerts, M.", "Frijns, A.", "Gaona, G.", "Garg, V.", "Gauthier, S.", "Jabbari, S. G.", "Harimi, D.", "Hellwig, R. T.", "Huebner, G. M.", "Jin, Q.", "Jowkar, M.", "Kim, J.", "King, N.", "Kingma, B.", "Koerniawan, M. D.", "Kolarik, J.", "Kumar, S.", "Kwok, A.", "Lamberts, R.", "Laska, M.", "Lee, M. C. J.", "Lee, Y.", "Lindermayr, V.", "Mahaki, M.", "Marcel-Okafor, U.", "Marín-Restrepo, L.", "Marquardsen, A.", "Martellotta, F.", "Mathur, J.", "Mino-Rodriguez, I.", "Montazami, A.", "Mou, D.", "Moujalled, B.", "Nakajima, M.", "Ng, E.", "Okafor, M.", "Olweny, M.", "Ouyang, W.", "Papst de Abreu, A. L.", "Pérez-Fargallo, A.", "Rajapaksha, I.", "Ramos, G.", "Rashid, S.", "Reinhart, C. F.", "Rivera, M. I.", "Salmanzadeh, M.", "Schakib-Ekbatan, K.", "Schiavon, S.", "Shooshtarian, S.", "Shukuya, M.", "Soebarto, V.", "Suhendri, S.", "Tahsildoost, M.", "Tartarini, F.", "Teli, D.", "Tewari, P.", "Thapa, S.", "Trebilcock, M.", "Trojan, J.", "Tukur, R. B.", "Voelker, C.", "Yam, Y.", "Yang, L.", "Zapata-Lancaster, G.", "Zhai, Y.", "Zhu, Y.", "Zomorodian, Z.", "Farm Area Segmentation in Satellite Images Using DeepLabv3+ Neural Networks", "Sharifzadeh, S.", "Tata, J.", "Sharifzadeh, H.", "Tan, B.", "Springer "], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/ibnu-febry-kurniawan", "https://pureportal.coventry.ac.uk/en/persons/fei-he"], "publication_date": ["21 Dec 2020"]},
{"title": ["A machine learning based software pipeline to pick the variable ordering for algorithms with polynomial inputs"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/a-machine-learning-based-software-pipeline-to-pick-the-variable-o", "abstract": ["We are interested in the application of Machine Learning (ML) technology to improve mathematical software.  It may seem that the probabilistic nature of ML tools would invalidate the exact results prized by such software, however, the algorithms which underpin the software often come with a range of choices which are good candidates for ML application.  We refer to choices which have no effect on the mathematical correctness of the software, but do impact its performance.  ", "In the past we experimented with one such choice:  the variable ordering to use when building a Cylindrical Algebraic Decomposition (CAD).  We used the Python library Scikit-Learn (sklearn) to experiment with different ML models, and developed new techniques for feature generation and hyper-parameter selection.  ", "These techniques could easily be adapted for making decisions other than our immediate application of CAD variable ordering.  Hence in this paper we present a software pipeline to use sklearn to pick the variable ordering for an algorithm that acts on a polynomial system.  The code described is freely available online."], "Keywords": ["Machine Learning", "Software", "Polynomials", "Pipelines", "Machine learning", "Polynomial", "Python", "Decomposition"], "authors_name": ["Florescu, D.", "England, M.", "Springer International Publishing", "A new hardware approach to self-organizing maps", "Dias, L. A.", "Coutinho, M. G. F.", "Gaura, E.", "Fernandes, M. A. C.", "Institute of Electrical and Electronics Engineers Inc."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-england"], "publication_date": ["8 Jul 2020"]},
{"title": ["IO-VNBD: Inertial and Odometry Benchmark Dataset for Ground Vehicle Positioning"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/io-vnbd-inertial-and-odometry-benchmark-dataset-for-ground-vehicl", "abstract": ["Low-cost inertial navigation sensors (INS) can be exploited for a reliable tracking solution for autonomous vehicles. However, position errors grow exponentially due to noises in the measurements. Several deep learning techniques have been investigated to mitigate the errors for a better navigation solution [1-10]. However, these studies have involved the use of different datasets not made publicly available. The lack of a robust benchmark dataset has thus hindered the advancement in the research, comparison and adoption of deep learning techniques for vehicle positioning based on inertial navigation. In order to facilitate the benchmarking, fast development and evaluation of positioning algorithms, we therefore present the first of its kind large-scale and information-rich inertial and odometry focused public dataset called IO-VNBD (Inertial Odometry Vehicle Navigation Benchmark Dataset).The vehicle tracking dataset was recorded using a research vehicle equipped with ego-motion sensors on public roads in the United Kingdom, Nigeria, and France. The sensors include a GPS receiver, inertial navigation sensors, wheel-speed sensors amongst other sensors found on the car as well as the inertial navigation sensors and GPS receiver in an android smart phone sampling at 10HZ. A diverse number of scenarios and vehicle dynamics are captured such as traffic, round-abouts, hard-braking etc. on different road types (country roads, motorways etc.) with varying driving patterns. The dataset consists of a total driving time of about 40 hours over 1,300km for the vehicle extracted data and about 58 hours over 4,400 km for the smartphone recorded data. We hope that this dataset will prove valuable in furthering research on the correlation between vehicle dynamics and its displacement as well as other related studies "], "Keywords": ["Ground vehicles", "Navigation", "Sensors", "Deep learning", "Global positioning system", "Motion sensors", "Autonomous vehicles", "Benchmarking"], "authors_name": ["Onyekpe, U.", "Palade, V.", "Kanarachos, S.", "Szkolnik, A.", "arXiv", "Is modelling complexity always needed? Insights from modelling PrEP introduction in South Africa", "Grant, H.", "Foss, A. M.", "Watts, C.", "Medley, G. F.", "Mukandavire, Z."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["4 May 2020"]},
{"title": ["Opinion evidence in Cell Site Analysis"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/opinion-evidence-in-cell-site-analysis", "abstract": ["Issues concerning forensic inference exist in all areas of Forensic Science, and Cell Site Analysis is no exception. There is a standard concerning opinion evidence adopted by both the European Network of Forensic Science Institutes (ENFSI) and the Association of Forensic Science Providers (AFSP) based on the principles of the Case Assessment and Interpretation (CAI) Model widely used within “traditional” forensic Science. This standard has not been widely adopted, or does not appear to be particularly well known, either within Cell Site Analysis or in the general field of Digital Forensics. This paper is aimed at Cell Site Analysis experts and outlines the legislative and regulatory framework within which opinion in Cell Site Analysis is provided and addresses how the principles defined in the AFSP standard can be applied to Cell Site Analysis. A case example highlighting differences between a task-driven approach commonly used within Cell Site Analysis and a CAI approach to the same data is presented and explored."], "Keywords": ["Forensic Sciences"], "authors_name": ["Tart, M. S.", "Polymer in wedge-shaped confinement: Effect on the θ  temperature", "Kumar, S.", "Chuhan, K.", "Singh, S.", "Foster, D.", "Quantifying early COVID-19 outbreak transmission in South Africa and exploring vaccine efficacy scenarios", "Mukandavire, Z.", "Nyabadza, F.", "Malunguza, N. J.", "Cuadros, D. F.", "Shiri, T.", "Musuka, G.", "Safeguarding gains in the Sexual and Reproductive Health and AIDS Response amidst COVID-19: The Role of African Civil Society", "Eghtessadi, R.", "Mukandavire, Z.", "Mutenherwa, F.", "Cuadros, D. F.", "Musuka, G.", "Some Computational Considerations for Kernel-Based Support Vector Machine", "Esmaeilbeigi, M.", "Daneshkhah, A.", "Chatrabgoun, O.", "Springer", "Spatiotemporal transmission dynamics of the COVID-19 pandemic and its impact on critical healthcare capacity", "Cuadros, D. F.", "Xiao, Y.", "Mukandavire, Z.", "Correa-Agudelo, E.", "Hernández, A.", "Kim, H.", "MacKinnon, N. J.", "Stemming cholera tides in Zimbabwe through mass vaccination", "Mukandavire, Z.", "Manangazira, P.", "Nyabadza, F.", "Cuadros, D. F.", "Musuka, G.", "Morris, Jr, J. G."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-stephen-tart"], "publication_date": ["Jul 2020"]},
{"title": ["The empty womb, the unanswered prayer: Female Infertility and involuntary childlessness in British Mormon communities"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-empty-womb-the-unanswered-prayer-female-infertility-and-invol", "abstract": [], "Keywords": [], "authors_name": ["Halford, A.", "Routledge", "The impact of physical exercise on the fatigue symptoms in patients with multiple sclerosis: A systematic review and meta-analysis", "Razazian, N.", "Kazeminia, M.", "Moayedi, H.", "Daneshkhah, A.", "Shohaimi, S.", "Mohammadi, M.", "Jalali, R.", "Salari, N."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford"], "publication_date": ["28 Dec 2020"]},
{"title": ["Vehicular localisation at high and low estimation rates during gnss outages: A deep learning approach"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/vehicular-localisation-at-high-and-low-estimation-rates-during-gn", "abstract": [], "Keywords": ["Outages", "Deep learning", "Satellites", "Navigation", "Kalman filters", "Tall buildings", "Long short-term memory", "Triangulation"], "authors_name": ["Onyekpe, U.", "Kanarachos, S.", "Palade, V.", "Christopoulos, S. R. G.", "Springer Science and Business Media Deutschland GmbH"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/stavros-christopoulos", "https://pureportal.coventry.ac.uk/en/persons/vasile-palade"], "publication_date": ["25 Sep 2020"]},
{"title": ["The influence of acclimatization, age and gender-related differences on thermal perception in university buildings: case studies in Scotland and England"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/the-influence-of-acclimatization-age-and-gender-related-differenc", "abstract": ["The higher education sector in the UK is responsible for large amount of the country's energy consumption. Space heating, which is the largest and most expensive part of the energy used in the UK educational buildings is a potential target for improving energy efficiency. However, the role of thermal comfort in students' productivity in academic environments cannot be overlooked. Considering the prevalence of two different climatic conditions in Northern and Southern/Midland regions of the UK, this study investigated thermal comfort in two university campuses in Scotland and England. environmental measurements combined with a simultaneous questionnaire survey were conducted in eight university buildings in Edinburgh and Coventry. The field study was carried out during the academic year of 2017-18 on 3507 students. The results confirmed influence of students' acclimatization, showing a warmer than neutral mean Thermal Sensation Vote (TSV) and cooler thermal preference in Edinburgh than Coventry. The higher acceptable temperature in Coventry (23.5 °C) than Edinburgh (22.1 °C) reinforced the results on the influence of climatic adaptation. Thermal acceptability was examined in a direct (analysing the actual votes on thermal acceptability) and an indirect approach (considering the TSV between −1 and 1 as acceptable). The indirect approach was shown to be a better predictor of the thermal acceptability as this method extends beyond the acceptable range suggested by the direct method. Thermal perceptions of females were shown to be colder than males in university classrooms. However, no statistically significant difference was observed in the thermal comfort of different age groups."], "Keywords": ["acclimation", "gender", "building", "Midland Reduction", "student", "voter", "Energy Consumption", "Hot Temperature"], "authors_name": ["Jowkar, M.", "Rijal, H. B.", "Brusey, J.", "Montazami, A.", "Temeljotov-Salaj, A.", "The prevalence of Restless Legs Syndrome/Willis-ekbom disease (RLS/WED) in the third trimester of pregnancy: a systematic review", "Darvishi, N.", "Daneshkhah, A.", "Khaledi-Paveh, B.", "Vaisi-Raygani, A.", "Mohammadi, M.", "Salari, N.", "Darvishi, F.", "Abdi, A.", "Jalali, R.", "The prevalence of severe depression in Iranian older adult: a meta-analysis and meta-regression", "Salari, N.", "Mohammadi, M.", "Vaisi-Raygani, A.", "Abdi, A.", "Shohaimi, S.", "Khaledipaveh, B.", "Daneshkhah, A.", "Jalali, R.", "The prevalence of sleep disturbances among physicians and nurses facing the COVID-19 patients: a systematic review and meta-analysis", "Salari, N.", "Khazaie, H.", "Hosseinian-Far, A.", "Ghasemi, H.", "Mohammadi, M.", "Shohaimi, S.", "Daneshkhah, A.", "Khaledi-Paveh, B.", "Hosseinian-Far, M.", "The prevalence of stress, anxiety and depression within front-line healthcare workers caring for COVID-19 patients: a systematic review and meta-regression", "Salari, N.", "Khazaie, H.", "Hosseinian-Far, A.", "Khaledi-Paveh, B.", "Kazeminia, M.", "Mohammadi, M.", "Shohaimi, S.", "Daneshkhah, A.", "Eskandari, S.", "Time to Scale Up Preexposure Prophylaxis Beyond the Highest-Risk Populations? Modeling Insights From High-Risk Women in Sub-Saharan Africa", "Grant, H.", "Gomez, G. B.", "Kripke, K.", "Barnabas, R. V.", "Watts, C.", "Medley, G. F.", "Mukandavire, Z."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/james-brusey", "https://pureportal.coventry.ac.uk/en/persons/azadeh-montazami"], "publication_date": ["15 Jul 2020"]},
{"title": ["Algebraic tools in the study of Multistationarity of Chemical Reaction Networks"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/algebraic-tools-in-the-study-of-multistationarity-of-chemical-rea", "abstract": [], "Keywords": [], "authors_name": ["Sadeghimanesh, A.", "University of Copenhagen"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/amirhosein-sadeghimanesh-sadeghi-manesh"], "publication_date": ["Oct 2018"]},
{"title": ["Understanding Household Fuel Choice Behaviour in the Amazonas State, Brazil: Effects of Validation and Feature Selection"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/understanding-household-fuel-choice-behaviour-in-the-amazonas-sta", "abstract": ["Since 2003, Brazil has striven to provide energy access to all, in rural areas, in an effort to economically empower the communities. Unpacking fuel stacking behaviour can shed light onto the speed of transition toward the exclusive use of advanced fuel types. This paper presents findings from surveys that were carried out with 14 non-electrified communities in a rural area of Rio Negro, Amazonas State, Brazil. We identify the fuel choice determinants in these communities using a multinomial logistic regression model and more generally discuss the validity and robustness of such models in the context of statistical validation and evaluation metrics. Specifically for the Amazonas communities considered in this study, the research showed that the fuel choice determinants are the age of household, the number of people at meals each day, the number of meals daily, the community, education of the household head, and the income level of the household. Moreover, given the Brazilian policies related to energy and sustainability, this region is not likely to reach the Sustainable Development Goals proposed by United Nations for 2030."], "Keywords": ["Feature Selection", "Community", "Feature extraction", "Sustainable development", "Sustainable Development", "Determinant", "Sustainability", "Logistic regression", "Feature Selection", "Community", "Feature extraction", "alternative energy", "energy"], "authors_name": ["Gyamfi, K. S.", "Gaura, E.", "Brusey, J.", "Trindade, A. B.", "Verba, N."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/elena-gaura", "https://pureportal.coventry.ac.uk/en/persons/james-brusey"], "publication_date": ["28 Jul 2020"]},
{"title": ["h*pt: 一种鼓励质量平衡产量的 h 型指数"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/hpt-an-h-type-index-encouraging-quality-and-balancing-productivit", "abstract": ["As a balanced indicator for both the quality and productivity of researchers’ scientific outputs, h-index suffers severely from loss of significant information in citation distributions so that its ability to discriminate researchers is rather limited. H-index not only fails to distinguish researchers with quasi the same h-values, but also lacks the ability to promote researchers’ foci on originality and high quality. Current extensions to h-index by exploiting citation distribution characteristics all exhibit some “pathologically” eccentric behaviors against either real datasets or theoretical distributions. With a motivation of balancing quality and quantity, this paper proposes a new h-type index h*pt by exploiting citation distribution characteristics, which encourages quality by defining reward/penalty factors to excess/long-tail citations, and at the same time balances productivity by scaling citations outside the h-core to the average performance of the long-tail papers. Extensive experiments on both the ACL Anthology Network dataset and several theoretical citation distributions prove that the proposed h*pt achieves reasonably better results than previous h-type extensions."], "Keywords": ["Productivity", "Experiments"], "authors_name": ["Jiang, X."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["Jan 2017"]},
{"title": ["Cell site analysis: Roles and interpretation"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/cell-site-analysis-roles-and-interpretation", "abstract": ["This paper considers the confusion that exists between opinion and non-opinion evidence concerning telecommunication data – and thus the boundary between expert and technical evidence. The difference between presentation, explanation and interpretation (for Technical, Investigative or Evaluative purposes) of data is outlined. The authors consider how the term “interpretation” may be used differently in connection with expert witnesses, witnesses giving technical evidence, and by the judiciary, suggesting that this may give rise to unrealistic expectations of a practitioner’s ability to reliably answer questions. Recommendations for core competencies are made for those giving telecommunications evidence to recognise when they are presenting opinion evidence and therefore (potentially inadvertently) acting as expert witnesses."], "Keywords": ["Telecommunications", "Expert Testimony", "Confusion", "Motivation", "Aptitude"], "authors_name": ["Tart, M. S.", "Bird, R.", "Baldwin, D.", "Pope, S.", "Mass transpiration in magneto-hydrodynamic boundary layer flow over a superlinear stretching sheet embedded in porous medium with slip", "Vinay Kumar, P. N.", "Mahabaleshwar, U. S.", "Nagaraju, K. R.", "Mousavi Nezhad, M.", "Daneshkhah, A.", "Remote sensing technologies and energy applications in refugee camps", "Nixon, J. D.", "Gaura, E.", "Taylor and Francis - Balkema", "Spontaneous Fruit Fly Optimisation for truss weight minimisation: Performance evaluation based on the no free lunch theorem", "Onyekpe, U.", "Kanarachos, S.", "Fitzpatrick, M. E.", "The Scales Project, a cross-national dataset on the interpretation of thermal perception scales", "Azadeh, M.", " & 76 others", "Damiati, S. A.", "Daniel, L.", "Vecchi, R. D.", "Dhaka, S.", "Domínguez-Amarillo, S.", "Dudkiewicz, E.", "Edappilly, L. P.", "Fernández-Agüera, J.", "Folkerts, M.", "Frijns, A.", "Gaona, G.", "Garg, V.", "Gauthier, S.", "Jabbari, S. G.", "Harimi, D.", "Hellwig, R. T.", "Huebner, G. M.", "Jin, Q.", "Jowkar, M.", "Kania, R.", "Kim, J.", "King, N.", "Kingma, B.", "Koerniawan, M. D.", "Kolarik, J.", "Kumar, S.", "Kwok, A.", "Lamberts, R.", "Laska, M.", "Lee, M. C. J.", "Lee, Y.", "Lindermayr, V.", "Mahaki, M.", "Marcel-Okafor, U.", "Marín-Restrepo, L.", "Marquardsen, A.", "Martellotta, F.", "Mathur, J.", "McGill, G.", "Mino-Rodriguez, I.", "Mou, D.", "Moujalled, B.", "Nakajima, M.", "Ng, E.", "Okafor, M.", "Olweny, M.", "Ouyang, W.", "Papst de Abreu, A. L.", "Pérez-Fargallo, A.", "Rajapaksha, I.", "Ramos, G.", "Rashid, S.", "Reinhart, C. F.", "Rivera, M. I.", "Salmanzadeh, M.", "Schakib-Ekbatan, K.", "Schiavon, S.", "Shooshtarian, S.", "Shukuya, M.", "Soebarto, V.", "Suhendri", "Tahsildoost, M.", "Tartarini, F.", "Teli, D.", "Tewari, P.", "Thapa, S.", "Trebilcock, M.", "Trojan, J.", "Tukur, R. B.", "Voelker, C.", "Yam, Y.", "Yang, L.", "Zapata-Lancaster, G.", "Zhai, Y.", "Zhu, Y.", "Zomorodian, Z. S."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/matthew-stephen-tart"], "publication_date": ["28 Aug 2019"]},
{"title": ["Among the last ones to leave? Understanding the Journeys of Muslim Children in the Care System in England"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/among-the-last-ones-to-leave-understanding-the-journeys-of-muslim", "abstract": ["Children of Muslim heritage are likely to experience significant delay in finding a fostering or adoptive placement and where a child has complex needs due to health, disability, age, mixed or multiple heritage background or being part of a sibling group, finding permanent placement takes even longer. In some cases, they may never find a permanent home at all. Such delays cause lasting harm for children and according to Selwyn et al, ‘delay in decision making and action has an unacceptable price in terms of the reduction in children’s life chances and the financial costs to local authorities, the emotional and financial burden later placed on adoptive families and future costs to society’ (2006).  Policy makers’ response has been to emphasise transracial placements so that the process of finding a permanent home is expedited for these children.", "Through interviews with social workers, foster carers, adoptive parents and prospective adoptive parents, this research presents a research-informed narrative of the complexities in Muslim children’s circumstances and identities, which influence how decisions are made about their lives. By better understanding the journeys of these children through the care system, this research will provide an evidence base for practitioners, policy makers and communities to draw upon, and in doing so will improve outcomes for these children, their families and for society as a whole.", "This research provides strong evidence of the salience of Islam to Muslim children’s identities. When children come into care they experience upheaval, displacement and trauma – in such contexts faith is familiar and enables children to be resilient. If in their new home, children’s faith and ethnic needs are provided, they are happier, are more settled and attach better and sooner to their carers. Foster carers and adopters agree that faith is central to their identities too, that faith motivates them to care for the children they look after and that they may be best placed to meet the needs of children who come from ethnic and religious backgrounds similar to their own. For adopters there was an additional emphasis on the child they adopted ‘looking like them’. ", "Based on this key finding of the salience of religion to the formation, evolution and preservation of the identities of children in public care, we suggest 7 inter-related recommendations for policy makers, social workers, carers and for the Muslim community to take forward. We do not assign a particular recommendation to a particular group, instead we call for joined-up thinking and collective action from these stakeholders, aimed at prioritising each child’s welfare, security and happiness.", "As a final word we emphasise the good practice that we can evidence in how social workers address the faith needs of Muslim children. The story is by no means only about good practice. Indeed, we have found evidence of blind-spots and lacunae. Nevertheless for a profession that faces regular unfair coverage from the media, it is important to emphasise the strengths of the profession and the conscientious care it provides to the most vulnerable children in our societies. Our intention with this report, is to celebrate and share the good practice and where there are blind-spots to engage critically but also collegially to fill the gaps in provision.", "The seven recommendations we make on the basis of this project are as follows:", "Recommendation 1: Include religion in SSDA903 returns and the national DfE database on looked after children", "Recommendation 2: Recognise the salience of faith in children’s journeys through the care system and enhance the faith literacy of social work practitioners and policy makers.   ", "Recommendation 3: Develop and disseminate Islamic theological guidance on adoption and fostering that prioritises the children’s needs.", "Recommendation 4: Where required adoptive parents need be offered theological advice on the issue of establishing Mahram relations with their adopted children. If they choose to lactate their children they should be offered medical support", "Recommendation 5: The agreements between Islamic modesty guidelines and safeguarding policy need to be shared with Muslim foster carers.", "Recommendation 6: In line with the recommendation of the Education Select Committee, more outreach, information and recruitment work needs to be undertaken with diverse British Muslim communities to increase the number of Muslim foster carers and adopters.", "Recommendation 7: Need to evaluate the impact of the removal of ethnicity from adoption law and guidance in England on practice."], "Keywords": ["Muslim", "faith", "adoptive parents", "social worker", "adopted child", "best practice", "evidence", "adoption law", "Islam", "Politics", "Religion", "Child Care", "Muslim"], "authors_name": ["Cheruvallil-Contractor, S.", "Halford, A.", "Boti Phiri, M. J.", "De Souza, S.", "Penny Appeal", "Discrete Weighted Exponential Distribution of the Second Type: Properties and Applications", "Rasekhi, M.", "Chatrabgoun, O.", "Daneshkhah, A."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/alison-halford", "https://pureportal.coventry.ac.uk/en/persons/sariya-cheruvallil-contractor"], "publication_date": ["2018"]},
{"title": ["基于城市群的空气质量数据的可视分析方法研究"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/urban-agglomerations-based-visual-analysis-of-air-quality-data", "abstract": ["Air pollution has gradually become an important issue, and has attracted more and more attention from the general public and the scientific community. How do different cities interact with each other with respect to the air quality issue? What is the similarity and difference among the air quality attributes of distinct cities, and what factors may influence the interaction? We answer these intricate questions by proposing a comprehensive visual analysis system to explore the evolution of an urban agglomeration. The method proposes a Voronoi diagram to show the spatial distribution of urban agglomeration and the evolution of urban agglomeration in space, a stacked graph with threads embedded to show urban agglomeration in the time evolution process, and a parallel coordinates diagram to show the pollution situation of urban agglomerations. We have applied our method to the real urban air quality data. Our system was used to explore the evolution of urban agglomeration and provide a necessary foundation for united pollution prevention of urban agglomerations."], "Keywords": ["Air quality", "Agglomeration", "Pollution", "Air pollution", "Spatial distribution"], "authors_name": ["Sun, G.", "Hu, Y.", "Jiang, L.", "Jiang, X.", "Liang, R.", "Major Differences of Cloud Computing Adoption in Universities: Europe vs Middle East", "Odeh, M.", "Warwick, K.", "Cadenas, O.", "Extraction of cardiac and respiratory motion information from cardiac x-ray fluoroscopy images using hierarchical manifold learning", "Panayiotou, M.", "King, A. P.", "Bhatia, K. K.", "Housden, R. J.", "Ma, Y.", "Rinaldi, C. A.", "Gill, J. S.", "Cooklin, M.", "O'Neill, M.", "Rhode, K. S.", "Springer Verlag", "Infarct Segmentation Challenge on Delayed Enhancement MRI of the Left Ventricle", "Karim, R.", "Claus, P.", "Chen, Z.", "Housden, R. J.", "Obom, S.", "Gill, H.", "Ma, Y.", "Acheampong, P.", "O'Neill, M.", "Razavi, R.", "Rhode, K. S.", "Springer Verlag", "Real-Time Catheter Extraction from 2D X-Ray Fluoroscopic and 3D Echocardiographic Images for Cardiac Interventions", "Wu, X.", "Housden, J.", "Ma, Y.", "Rueckert, D.", "Rhode, K. S.", "Springer Verlag"], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["15 Mar 2017"]},
{"title": ["Adding Logical Operators to Tree Pattern Queries onGraph-Structured Data"], "publication_link": "https://pureportal.coventry.ac.uk/en/publications/adding-logical-operators-to-tree-pattern-queries-ongraph-structur", "abstract": ["As data are increasingly modeled as graphs for expressing com-plex relationships, the tree pattern query on graph-structured databecomes an important type of queries in real-world applications.Most practical query languages, such as XQuery and SPARQL,support logical expressions using logical-AND/OR/NOT operatorsto define structural constraints of tree patterns. In this paper, (1)we propose generalized tree pattern queries (GTPQs) over graph-structured data, which fully support propositional logic of struc-tural constraints. (2) We make a thorough study of fundamentalproblems including satisfiability, containment and minimization,and analyze the computational complexity and the decision pro-cedures of these problems. (3) We propose a compact graph repre-sentation of intermediate results and a pruning approach to reducethe size of intermediate results and the number of join operations –two factors that often impair the efficiency of traditional algorithmsfor evaluating tree pattern queries. (4) We present an efficient algo-rithm for evaluating GTPQs using 3-hop as the underlying reach-ability index. (5) Experiments on both real-life and synthetic datasets demonstrate the effectiveness and efficiency of our algorithm,from several times to orders of magnitude faster than state-of-the-art algorithms in terms of evaluation time, even for traditional treepattern queries with only conjunctive operations."], "Keywords": ["Query languages", "Computational complexity", "Experiments"], "authors_name": ["Zeng, Q.", "Jiang, X.", "Zhuge, H.", "VLDB Endowment Inc."], "authors_links": ["https://pureportal.coventry.ac.uk/en/persons/xiaorui-jiang"], "publication_date": ["Aug 2012"]}
]